apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
/****************************************************************************
 * arch/xtensa/src/esp32/hardware/esp32_spi.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_SPI_H
#define __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_SPI_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32_soc.h"

#define REG_SPI_BASE(i)         (DR_REG_SPI1_BASE + (((i)>1) ? (((i)* 0x1000) + 0x20000) : (((~(i)) & 1)* 0x1000 )))

#define SPI_CMD_OFFSET          (0x0)
#define SPI_CMD_REG(i)          (REG_SPI_BASE(i) + SPI_CMD_OFFSET)

/* SPI_FLASH_READ : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: Read flash enable. Read flash operation will be triggered
 * when the bit is set. The bit will be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_READ          (BIT(31))
#define SPI_FLASH_READ_M        (BIT(31))
#define SPI_FLASH_READ_V        0x1
#define SPI_FLASH_READ_S        31

/* SPI_FLASH_WREN : R/W ;bitpos:[30] ;default: 1'b0 ; */

/* Description: Write flash enable.  Write enable command will be sent when
 * the bit is set. The bit will be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_WREN          (BIT(30))
#define SPI_FLASH_WREN_M        (BIT(30))
#define SPI_FLASH_WREN_V        0x1
#define SPI_FLASH_WREN_S        30

/* SPI_FLASH_WRDI : R/W ;bitpos:[29] ;default: 1'b0 ; */

/* Description: Write flash disable. Write disable command will be sent when
 * the bit is set. The bit will be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_WRDI          (BIT(29))
#define SPI_FLASH_WRDI_M        (BIT(29))
#define SPI_FLASH_WRDI_V        0x1
#define SPI_FLASH_WRDI_S        29

/* SPI_FLASH_RDID : R/W ;bitpos:[28] ;default: 1'b0 ; */

/* Description: Read JEDEC ID . Read ID command will be sent when the bit is
 * set. The bit will be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_RDID          (BIT(28))
#define SPI_FLASH_RDID_M        (BIT(28))
#define SPI_FLASH_RDID_V        0x1
#define SPI_FLASH_RDID_S        28

/* SPI_FLASH_RDSR : R/W ;bitpos:[27] ;default: 1'b0 ; */

/* Description: Read status register-1. Read status operation will be
 * triggered when the bit is set. The bit will be cleared once the operation
 * done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_RDSR          (BIT(27))
#define SPI_FLASH_RDSR_M        (BIT(27))
#define SPI_FLASH_RDSR_V        0x1
#define SPI_FLASH_RDSR_S        27

/* SPI_FLASH_WRSR : R/W ;bitpos:[26] ;default: 1'b0 ; */

/* Description: Write status register enable. Write status operation will
 * be triggered when the bit is set. The bit will be cleared once the
 * operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_WRSR          (BIT(26))
#define SPI_FLASH_WRSR_M        (BIT(26))
#define SPI_FLASH_WRSR_V        0x1
#define SPI_FLASH_WRSR_S        26

/* SPI_FLASH_PP : R/W ;bitpos:[25] ;default: 1'b0 ; */

/* Description: Page program enable(1 byte ~256 bytes data to be programmed).
 * Page program operation will be triggered when the bit is set. The bit will
 * be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_PP            (BIT(25))
#define SPI_FLASH_PP_M          (BIT(25))
#define SPI_FLASH_PP_V          0x1
#define SPI_FLASH_PP_S          25

/* SPI_FLASH_SE : R/W ;bitpos:[24] ;default: 1'b0 ; */

/* Description: Sector erase enable. A 4KB sector is erased via SPI command
 * 20H. Sector erase operation will be triggered when the bit is set. The bit
 * will be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_SE            (BIT(24))
#define SPI_FLASH_SE_M          (BIT(24))
#define SPI_FLASH_SE_V  0x1
#define SPI_FLASH_SE_S  24

/* SPI_FLASH_BE : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: Block erase enable. A 64KB block is erased via SPI command
 * D8H. Block erase operation will be triggered when the bit is set. The bit
 * will be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_BE            (BIT(23))
#define SPI_FLASH_BE_M          (BIT(23))
#define SPI_FLASH_BE_V          0x1
#define SPI_FLASH_BE_S          23

/* SPI_FLASH_CE : R/W ;bitpos:[22] ;default: 1'b0 ; */

/* Description: Chip erase enable. Chip erase operation will be triggered
 * when the bit is set. The bit will be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_CE            (BIT(22))
#define SPI_FLASH_CE_M          (BIT(22))
#define SPI_FLASH_CE_V          0x1
#define SPI_FLASH_CE_S          22

