apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
/* SPI_FLASH_DP : R/W ;bitpos:[21] ;default: 1'b0 ; */

/* Description: Drive Flash into power down.  An operation will be triggered
 * when the bit is set. The bit will be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_DP            (BIT(21))
#define SPI_FLASH_DP_M          (BIT(21))
#define SPI_FLASH_DP_V          0x1
#define SPI_FLASH_DP_S          21

/* SPI_FLASH_RES : R/W ;bitpos:[20] ;default: 1'b0 ; */

/* Description: This bit combined with reg_resandres bit releases Flash from
 * the power-down state or high performance mode and obtains the devices ID.
 * The bit will be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_RES           (BIT(20))
#define SPI_FLASH_RES_M         (BIT(20))
#define SPI_FLASH_RES_V         0x1
#define SPI_FLASH_RES_S         20

/* SPI_FLASH_HPM : R/W ;bitpos:[19] ;default: 1'b0 ; */

/* Description: Drive Flash into high performance mode. The bit will be
 * cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_HPM           (BIT(19))
#define SPI_FLASH_HPM_M         (BIT(19))
#define SPI_FLASH_HPM_V         0x1
#define SPI_FLASH_HPM_S         19

/* SPI_USR : R/W ;bitpos:[18] ;default: 1'b0 ; */

/* Description: User define command enable. An operation will be triggered
 * when the bit is set. The bit will be cleared once the operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_USR                 (BIT(18))
#define SPI_USR_M               (BIT(18))
#define SPI_USR_V               0x1
#define SPI_USR_S               18

/* SPI_FLASH_PES : R/W ;bitpos:[17] ;default: 1'b0 ; */

/* Description: program erase suspend bit  program erase suspend operation
 * will be triggered when the bit is set. The bit will be cleared once the
 * operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_PES           (BIT(17))
#define SPI_FLASH_PES_M         (BIT(17))
#define SPI_FLASH_PES_V         0x1
#define SPI_FLASH_PES_S         17

/* SPI_FLASH_PER : R/W ;bitpos:[16] ;default: 1'b0 ; */

/* Description: program erase resume bit  program erase suspend operation
 * will be triggered when the bit is set. The bit will be cleared once the
 * operation done.
 * 1: enable
 * 0: disable.
 */

#define SPI_FLASH_PER           (BIT(16))
#define SPI_FLASH_PER_M         (BIT(16))
#define SPI_FLASH_PER_V         0x1
#define SPI_FLASH_PER_S         16

#define SPI_ADDR_OFFSET         (0x4)
#define SPI_ADDR_REG(i)         (REG_SPI_BASE(i) + SPI_ADDR_OFFSET)

/* The CSV actually is wrong here. It indicates that the lower 8 bits of
 * this register are reserved. This is not true, all 32 bits of
 * SPI_ADDR_REG are usable/used.
 */

#define SPI_CTRL_OFFSET         (0x8)
#define SPI_CTRL_REG(i)         (REG_SPI_BASE(i) + SPI_CTRL_OFFSET)

/* SPI_WR_BIT_ORDER : R/W ;bitpos:[26] ;default: 1'b0 ; */

/* Description: In command address write-data (MOSI) phases
 * 1: LSB first
 * 0: MSB first
 */

#define SPI_WR_BIT_ORDER        (BIT(26))
#define SPI_WR_BIT_ORDER_M      (BIT(26))
#define SPI_WR_BIT_ORDER_V      0x1
#define SPI_WR_BIT_ORDER_S      26

/* SPI_RD_BIT_ORDER : R/W ;bitpos:[25] ;default: 1'b0 ; */

/* Description: In read-data (MISO) phase
 * 1: LSB first
 * 0: MSB first
 */

#define SPI_RD_BIT_ORDER        (BIT(25))
#define SPI_RD_BIT_ORDER_M      (BIT(25))
#define SPI_RD_BIT_ORDER_V      0x1
#define SPI_RD_BIT_ORDER_S      25

/* SPI_FREAD_QIO : R/W ;bitpos:[24] ;default: 1'b0 ; */

/* Description: In the read operations address phase and read-data phase
 * apply 4 signals.
 * 1: enable
 * 0: disable.
 */

#define SPI_FREAD_QIO           (BIT(24))
#define SPI_FREAD_QIO_M         (BIT(24))
#define SPI_FREAD_QIO_V         0x1
#define SPI_FREAD_QIO_S         24

/* SPI_FREAD_DIO : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: In the read operations address phase and read-data phase
 * apply 2 signals.
 * 1: enable
 * 0: disable.
 */

#define SPI_FREAD_DIO           (BIT(23))
#define SPI_FREAD_DIO_M         (BIT(23))
#define SPI_FREAD_DIO_V         0x1
#define SPI_FREAD_DIO_S         23

/* SPI_WRSR_2B : R/W ;bitpos:[22] ;default: 1'b0 ; */

/* Description: two bytes data will be written to status register when it
 * is set.
 * 1: enable
 * 0: disable.
 */

#define SPI_WRSR_2B             (BIT(22))
#define SPI_WRSR_2B_M           (BIT(22))
#define SPI_WRSR_2B_V           0x1
#define SPI_WRSR_               2B_S  22

/* SPI_WP_REG : R/W ;bitpos:[21] ;default: 1'b1 ; */

/* Description: Write protect signal output when SPI is idle.
 * 1: output high
 * 0: output low.
 */

#define SPI_WP_REG              (BIT(21))
#define SPI_WP_REG_M            (BIT(21))
#define SPI_WP_REG_V            0x1
#define SPI_WP_REG_S            21

/* SPI_FREAD_QUAD : R/W ;bitpos:[20] ;default: 1'b0 ; */

/* Description: In the read operations read-data phase apply 4 signals.
 * 1: enable
 * 0: disable.
 */

#define SPI_FREAD_QUAD          (BIT(20))
#define SPI_FREAD_QUAD_M        (BIT(20))
#define SPI_FREAD_QUAD_V        0x1
#define SPI_FREAD_QUAD_S        20

/* SPI_RESANDRES : R/W ;bitpos:[15] ;default: 1'b1 ; */

/* Description: The Device ID is read out to SPI_RD_STATUS register, this
 * bit combine with spi_flash_res bit.
 * 1: enable
 * 0: disable.
 */

#define SPI_RESANDRES           (BIT(15))
#define SPI_RESANDRES_M         (BIT(15))
#define SPI_RESANDRES_V         0x1
#define SPI_RESANDRES_S         15

/* SPI_FREAD_DUAL : R/W ;bitpos:[14] ;default: 1'b0 ; */

/* Description: In the read operations  read-data phase apply 2 signals.
 * 1: enable
 * 0: disable.
 */

#define SPI_FREAD_DUAL          (BIT(14))
#define SPI_FREAD_DUAL_M        (BIT(14))
#define SPI_FREAD_DUAL_V        0x1
#define SPI_FREAD_DUAL_S        14

/* SPI_FASTRD_MODE : R/W ;bitpos:[13] ;default: 1'b1 ; */

/* Description: This bit enable the bits:
 *   spi_fread_qio, spi_fread_dio, spi_fread_qout and spi_fread_dout.
 *   1: enable
 *   0: disable.
 */

#define SPI_FASTRD_MODE         (BIT(13))
#define SPI_FASTRD_MODE_M       (BIT(13))
#define SPI_FASTRD_MODE_V       0x1
#define SPI_FASTRD_MODE_S       13

