apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
/* SPI_WAIT_FLASH_IDLE_EN : R/W ;bitpos:[12] ;default: 1'b0 ; */

/* Description: wait flash idle when program flash or erase flash.
 * 1: enable
 * 0: disable.
 */

#define SPI_WAIT_FLASH_IDLE_EN    (BIT(12))
#define SPI_WAIT_FLASH_IDLE_EN_M  (BIT(12))
#define SPI_WAIT_FLASH_IDLE_EN_V  0x1
#define SPI_WAIT_FLASH_IDLE_EN_S  12

/* SPI_TX_CRC_EN : R/W ;bitpos:[11] ;default: 1'b0 ; */

/* Description: For SPI1 enable crc32 when writing encrypted data to flash.
 * 1: enable
 * 0: disable
 */

#define SPI_TX_CRC_EN           (BIT(11))
#define SPI_TX_CRC_EN_M         (BIT(11))
#define SPI_TX_CRC_EN_V         0x1
#define SPI_TX_CRC_EN_S         11

/* SPI_FCS_CRC_EN : R/W ;bitpos:[10] ;default: 1'b1 ; */

/* Description: For SPI1  initialize crc32 module before writing encrypted
 * data to flash. Active low.
 */

#define SPI_FCS_CRC_EN          (BIT(10))
#define SPI_FCS_CRC_EN_M        (BIT(10))
#define SPI_FCS_CRC_EN_V        0x1
#define SPI_FCS_CRC_EN_S        10

#define SPI_CTRL1_OFFSET        (0xC)
#define SPI_CTRL1_REG(i)        (REG_SPI_BASE(i) + SPI_CTRL1_OFFSET)

/* SPI_CS_HOLD_DELAY : R/W ;bitpos:[31:28] ;default: 4'h5 ; */

/* Description: SPI cs signal is delayed by spi clock cycles */

#define SPI_CS_HOLD_DELAY       0x0000000F
#define SPI_CS_HOLD_DELAY_M     ((SPI_CS_HOLD_DELAY_V)<<(SPI_CS_HOLD_DELAY_S))
#define SPI_CS_HOLD_DELAY_V     0xF
#define SPI_CS_HOLD_DELAY_S     28

/* SPI_CS_HOLD_DELAY_RES : R/W ;bitpos:[27:16] ;default: 12'hfff ; */

/* Description: Delay cycles of resume Flash when resume Flash is enable
 * by spi clock.
 */

#define SPI_CS_HOLD_DELAY_RES    0x00000FFF
#define SPI_CS_HOLD_DELAY_RES_M  ((SPI_CS_HOLD_DELAY_RES_V)<<(SPI_CS_HOLD_DELAY_RES_S))
#define SPI_CS_HOLD_DELAY_RES_V  0xFFF
#define SPI_CS_HOLD_DELAY_RES_S  16

#define SPI_RD_STATUS_OFFSET    (0x10)
#define SPI_RD_STATUS_REG(i)    (REG_SPI_BASE(i) + SPI_RD_STATUS_OFFSET)

/* SPI_STATUS_EXT : R/W ;bitpos:[31:24] ;default: 8'h00 ; */

/* Description: In the slave mode,it is the status for master to read out. */

#define SPI_STATUS_EXT          0x000000FF
#define SPI_STATUS_EXT_M        ((SPI_STATUS_EXT_V)<<(SPI_STATUS_EXT_S))
#define SPI_STATUS_EXT_V        0xFF
#define SPI_STATUS_EXT_S        24

/* SPI_WB_MODE : R/W ;bitpos:[23:16] ;default: 8'h00 ; */

/* Description: Mode bits in the flash fast read mode, it is combined with
 * spi_fastrd_mode bit.
 */

#define SPI_WB_MODE             0x000000FF
#define SPI_WB_MODE_M           ((SPI_WB_MODE_V)<<(SPI_WB_MODE_S))
#define SPI_WB_MODE_V           0xFF
#define SPI_WB_MODE_S           16

/* SPI_STATUS : R/W ;bitpos:[15:0] ;default: 16'b0 ; */

/* Description: In the slave mode, it is the status for master to read out. */

#define SPI_S_STATUS            0x0000FFFF
#define SPI_S_STATUS_M          ((SPI_STATUS_V)<<(SPI_STATUS_S))
#define SPI_S_STATUS_V          0xFFFF
#define SPI_S_STATUS_S          0

#define SPI_CTRL2_OFFSET        (0x14)
#define SPI_CTRL2_REG(i)        (REG_SPI_BASE(i) + SPI_CTRL2_OFFSET)

/* SPI_CS_DELAY_NUM : R/W ;bitpos:[31:28] ;default: 4'h0 ; */

/* Description: spi_cs signal is delayed by system clock cycles */

#define SPI_CS_DELAY_NUM  0x0000000F
#define SPI_CS_DELAY_NUM_M      ((SPI_CS_DELAY_NUM_V)<<(SPI_CS_DELAY_NUM_S))
#define SPI_CS_DELAY_NUM_V      0xF
#define SPI_CS_DELAY_NUM_S      28

/* SPI_CS_DELAY_MODE : R/W ;bitpos:[27:26] ;default: 2'h0 ; */

/* Description: spi_cs signal is delayed by spi_clk.
 * 0: zero
 * 1: if spi_ck_out_edge or spi_ck_i_edge is set 1 delayed by half cycle
 *    else delayed by one cycle
 * 2: if spi_ck_out_edge or spi_ck_i_edge is set 1 delayed by one cycle
 *    else delayed by half cycle
 * 3: delayed one cycle
 */

#define SPI_CS_DELAY_MODE       0x00000003
#define SPI_CS_DELAY_MODE_M     ((SPI_CS_DELAY_MODE_V)<<(SPI_CS_DELAY_MODE_S))
#define SPI_CS_DELAY_MODE_V     0x3
#define SPI_CS_DELAY_MODE_S     26

/* SPI_MOSI_DELAY_NUM : R/W ;bitpos:[25:23] ;default: 3'h0 ; */

/* Description: MOSI signals are delayed by system clock cycles */

#define SPI_MOSI_DELAY_NUM      0x00000007
#define SPI_MOSI_DELAY_NUM_M    ((SPI_MOSI_DELAY_NUM_V)<<(SPI_MOSI_DELAY_NUM_S))
#define SPI_MOSI_DELAY_NUM_V    0x7
#define SPI_MOSI_DELAY_NUM_S    23

/* SPI_MOSI_DELAY_MODE : R/W ;bitpos:[22:21] ;default: 2'h0 ; */

/* Description: MOSI signals are delayed by spi_clk.
 * 0: zero
 * 1: if spi_ck_out_edge or spi_ck_i_edge is set 1 delayed by half cycle
 *   else delayed by one cycle
 * 2: if spi_ck_out_edge or spi_ck_i_edge is set 1 delayed by one cycle
 *   else delayed by half cycle
 * 3: delayed one cycle
 */

#define SPI_MOSI_DELAY_MODE     0x00000003
#define SPI_MOSI_DELAY_MODE_M   ((SPI_MOSI_DELAY_MODE_V)<<(SPI_MOSI_DELAY_MODE_S))
#define SPI_MOSI_DELAY_MODE_V   0x3
#define SPI_MOSI_DELAY_MODE_S   21

/* SPI_MISO_DELAY_NUM : R/W ;bitpos:[20:18] ;default: 3'h0 ; */

/* Description: MISO signals are delayed by system clock cycles */

#define SPI_MISO_DELAY_NUM      0x00000007
#define SPI_MISO_DELAY_NUM_M    ((SPI_MISO_DELAY_NUM_V)<<(SPI_MISO_DELAY_NUM_S))
#define SPI_MISO_DELAY_NUM_V    0x7
#define SPI_MISO_DELAY_NUM_S    18

/* SPI_MISO_DELAY_MODE : R/W ;bitpos:[17:16] ;default: 2'h0 ; */

/* Description: MISO signals are delayed by spi_clk.
 * 0: zero
 * 1: if spi_ck_out_edge or spi_ck_i_edge is set 1 delayed by half cycle
 *    else delayed by one cycle
 * 2: if spi_ck_out_edge or spi_ck_i_edge is set 1 delayed by one cycle
 *    else delayed by half cycle
 * 3: delayed one cycle
 */

#define SPI_MISO_DELAY_MODE     0x00000003
#define SPI_MISO_DELAY_MODE_M   ((SPI_MISO_DELAY_MODE_V)<<(SPI_MISO_DELAY_MODE_S))
#define SPI_MISO_DELAY_MODE_V   0x3
#define SPI_MISO_DELAY_MODE_S   16

/* SPI_CK_OUT_HIGH_MODE : R/W ;bitpos:[15:12] ;default: 4'h0 ; */

/* Description: modify spi clock duty ratio when the value is lager than 8,
 * the bits are combined with spi_clkcnt_N bits and spi_clkcnt_H bits.
 */

#define SPI_CK_OUT_HIGH_MODE    0x0000000F
#define SPI_CK_OUT_HIGH_MODE_M  ((SPI_CK_OUT_HIGH_MODE_V)<<(SPI_CK_OUT_HIGH_MODE_S))
#define SPI_CK_OUT_HIGH_MODE_V  0xF
#define SPI_CK_OUT_HIGH_MODE_S  12

/* SPI_CK_OUT_LOW_MODE : R/W ;bitpos:[11:8] ;default: 4'h0 ; */

/* Description: modify spi clock duty ratio when the value is lager than 8,
 * the bits are combined with spi_clkcnt_N bits and spi_clkcnt_L bits.
 */

#define SPI_CK_OUT_LOW_MODE     0x0000000F
#define SPI_CK_OUT_LOW_MODE_M   ((SPI_CK_OUT_LOW_MODE_V)<<(SPI_CK_OUT_LOW_MODE_S))
#define SPI_CK_OUT_LOW_MODE_V   0xF
#define SPI_CK_OUT_LOW_MODE_S   8

/* SPI_HOLD_TIME : R/W ;bitpos:[7:4] ;default: 4'h1 ; */

/* Description: delay cycles of cs pin by spi clock, this bits combined with
 * spi_cs_hold bit.
 */

#define SPI_HOLD_TIME           0x0000000F
#define SPI_HOLD_TIME_M         ((SPI_HOLD_TIME_V)<<(SPI_HOLD_TIME_S))
#define SPI_HOLD_TIME_V         0xF
#define SPI_HOLD_TIME_S         4

/* SPI_SETUP_TIME : R/W ;bitpos:[3:0] ;default: 4'h1 ; */

/* Description: (cycles-1) of ¡°prepare¡± phase by spi clock, this bits
 * combined with spi_cs_setup bit.
 */

#define SPI_SETUP_TIME          0x0000000F
#define SPI_SETUP_TIME_M        ((SPI_SETUP_TIME_V)<<(SPI_SETUP_TIME_S))
#define SPI_SETUP_TIME_V        0xF
#define SPI_SETUP_TIME_S        0

#define SPI_CLOCK_OFFSET        (0x18)
#define SPI_CLOCK_REG(i)        (REG_SPI_BASE(i) + SPI_CLOCK_OFFSET)

/* SPI_CLK_EQU_SYSCLK : R/W ;bitpos:[31] ;default: 1'b1 ; */

/* Description: In the master mode 1: spi_clk is equal to system 0: spi_clk
 * is divided from system clock.
 */

#define SPI_CLK_EQU_SYSCLK      (BIT(31))
#define SPI_CLK_EQU_SYSCLK_M    (BIT(31))
#define SPI_CLK_EQU_SYSCLK_V    0x1
#define SPI_CLK_EQU_SYSCLK_S    31

/* SPI_CLKDIV_PRE : R/W ;bitpos:[30:18] ;default: 13'b0 ; */

/* Description: In the master mode it is pre-divider of spi_clk. */

#define SPI_CLKDIV_PRE          0x00001FFF
#define SPI_CLKDIV_PRE_M        ((SPI_CLKDIV_PRE_V)<<(SPI_CLKDIV_PRE_S))
#define SPI_CLKDIV_PRE_V        0x1FFF
#define SPI_CLKDIV_PRE_S        18

/* SPI_CLKCNT_N : R/W ;bitpos:[17:12] ;default: 6'h3 ; */

/* Description: In the master mode it is the divider of spi_clk. So spi_clk
 * frequency is system/(spi_clkdiv_pre+1)/(spi_clkcnt_N+1)
 */

#define SPI_CLKCNT_N            0x0000003F
#define SPI_CLKCNT_N_M          ((SPI_CLKCNT_N_V)<<(SPI_CLKCNT_N_S))
#define SPI_CLKCNT_N_V          0x3F
#define SPI_CLKCNT_N_S          12

