apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
/* SPI_CLKCNT_H : R/W ;bitpos:[11:6] ;default: 6'h1 ; */

/* Description: In the master mode it must be floor((spi_clkcnt_N+1)/2-1).
 * In the slave mode it must be 0.
 */

#define SPI_CLKCNT_H            0x0000003F
#define SPI_CLKCNT_H_M          ((SPI_CLKCNT_H_V)<<(SPI_CLKCNT_H_S))
#define SPI_CLKCNT_H_V          0x3F
#define SPI_CLKCNT_H_S          6

/* SPI_CLKCNT_L : R/W ;bitpos:[5:0] ;default: 6'h3 ; */

/* Description: In the master mode it must be equal to spi_clkcnt_N.
 * In the slave mode it must be 0.
 */

#define SPI_CLKCNT_L            0x0000003F
#define SPI_CLKCNT_L_M          ((SPI_CLKCNT_L_V)<<(SPI_CLKCNT_L_S))
#define SPI_CLKCNT_L_V          0x3F
#define SPI_CLKCNT_L_S          0

#define SPI_USER_OFFSET         (0x1C)
#define SPI_USER_REG(i)         (REG_SPI_BASE(i) + SPI_USER_OFFSET)

/* SPI_USR_COMMAND : R/W ;bitpos:[31] ;default: 1'b1 ; */

/* Description: This bit enable the command phase of an operation. */

#define SPI_USR_COMMAND         (BIT(31))
#define SPI_USR_COMMAND_M       (BIT(31))
#define SPI_USR_COMMAND_V       0x1
#define SPI_USR_COMMAND_S       31

/* SPI_USR_ADDR : R/W ;bitpos:[30] ;default: 1'b0 ; */

/* Description: This bit enable the address phase of an operation. */

#define SPI_USR_ADDR            (BIT(30))
#define SPI_USR_ADDR_M          (BIT(30))
#define SPI_USR_ADDR_V          0x1
#define SPI_USR_ADDR_S          30

/* SPI_USR_DUMMY : R/W ;bitpos:[29] ;default: 1'b0 ; */

/* Description: This bit enable the dummy phase of an operation. */

#define SPI_USR_DUMMY           (BIT(29))
#define SPI_USR_DUMMY_M         (BIT(29))
#define SPI_USR_DUMMY_V         0x1
#define SPI_USR_DUMMY_S         29

/* SPI_USR_MISO : R/W ;bitpos:[28] ;default: 1'b0 ; */

/* Description: This bit enable the read-data phase of an operation. */

#define SPI_USR_MISO            (BIT(28))
#define SPI_USR_MISO_M          (BIT(28))
#define SPI_USR_MISO_V          0x1
#define SPI_USR_MISO_S          28

/* SPI_USR_MOSI : R/W ;bitpos:[27] ;default: 1'b0 ; */

/* Description: This bit enable the write-data phase of an operation. */

#define SPI_USR_MOSI            (BIT(27))
#define SPI_USR_MOSI_M          (BIT(27))
#define SPI_USR_MOSI_V          0x1
#define SPI_USR_MOSI_S          27

/* SPI_USR_DUMMY_IDLE : R/W ;bitpos:[26] ;default: 1'b0 ; */

/* Description: spi clock is disable in dummy phase when the bit is enable. */

#define SPI_USR_DUMMY_IDLE      (BIT(26))
#define SPI_USR_DUMMY_IDLE_M    (BIT(26))
#define SPI_USR_DUMMY_IDLE_V    0x1
#define SPI_USR_DUMMY_IDLE_S    26

/* SPI_USR_MOSI_HIGHPART : R/W ;bitpos:[25] ;default: 1'b0 ; */

/* Description: write-data phase only access to high-part of the buffer
 * spi_w8~spi_w15.
 * 1: enable
 * 0: disable.
 */

#define SPI_USR_MOSI_HIGHPART    (BIT(25))
#define SPI_USR_MOSI_HIGHPART_M  (BIT(25))
#define SPI_USR_MOSI_HIGHPART_V  0x1
#define SPI_USR_MOSI_HIGHPART_S  25

/* SPI_USR_MISO_HIGHPART : R/W ;bitpos:[24] ;default: 1'b0 ; */

/* Description: read-data phase only access to high-part of the buffer
 * spi_w8~spi_w15.
 * 1: enable
 * 0: disable.
 */

#define SPI_USR_MISO_HIGHPART    (BIT(24))
#define SPI_USR_MISO_HIGHPART_M  (BIT(24))
#define SPI_USR_MISO_HIGHPART_V  0x1
#define SPI_USR_MISO_HIGHPART_S  24

/* SPI_USR_PREP_HOLD : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: spi is hold at prepare state the bit combined with
 * spi_usr_hold_pol bit.
 */

#define SPI_USR_PREP_HOLD       (BIT(23))
#define SPI_USR_PREP_HOLD_M     (BIT(23))
#define SPI_USR_PREP_HOLD_V     0x1
#define SPI_USR_PREP_HOLD_S     23

/* SPI_USR_CMD_HOLD : R/W ;bitpos:[22] ;default: 1'b0 ; */

/* Description: spi is hold at command state the bit combined with
 * spi_usr_hold_pol bit.
 */

#define SPI_USR_CMD_HOLD        (BIT(22))
#define SPI_USR_CMD_HOLD_M      (BIT(22))
#define SPI_USR_CMD_HOLD_V      0x1
#define SPI_USR_CMD_HOLD_S      22

/* SPI_USR_ADDR_HOLD : R/W ;bitpos:[21] ;default: 1'b0 ; */

/* Description: spi is hold at address state the bit combined with
 * spi_usr_hold_pol bit.
 */

#define SPI_USR_ADDR_HOLD       (BIT(21))
#define SPI_USR_ADDR_HOLD_M     (BIT(21))
#define SPI_USR_ADDR_HOLD_V     0x1
#define SPI_USR_ADDR_HOLD_S     21

/* SPI_USR_DUMMY_HOLD : R/W ;bitpos:[20] ;default: 1'b0 ; */

/* Description: spi is hold at dummy state the bit combined with
 * spi_usr_hold_pol bit.
 */

#define SPI_USR_DUMMY_HOLD      (BIT(20))
#define SPI_USR_DUMMY_HOLD_M    (BIT(20))
#define SPI_USR_DUMMY_HOLD_V    0x1
#define SPI_USR_DUMMY_HOLD_S    20

/* SPI_USR_DIN_HOLD : R/W ;bitpos:[19] ;default: 1'b0 ; */

/* Description: spi is hold at data in state the bit combined with
 * spi_usr_hold_pol bit.
 */

#define SPI_USR_DIN_HOLD        (BIT(19))
#define SPI_USR_DIN_HOLD_M      (BIT(19))
#define SPI_USR_DIN_HOLD_V      0x1
#define SPI_USR_DIN_HOLD_S      19

/* SPI_USR_DOUT_HOLD : R/W ;bitpos:[18] ;default: 1'b0 ; */

/* Description: spi is hold at data out state the bit combined with
 * spi_usr_hold_pol bit.
 */

#define SPI_USR_DOUT_HOLD       (BIT(18))
#define SPI_USR_DOUT_HOLD_M     (BIT(18))
#define SPI_USR_DOUT_HOLD_V     0x1
#define SPI_USR_DOUT_HOLD_S     18

/* SPI_USR_HOLD_POL : R/W ;bitpos:[17] ;default: 1'b0 ; */

/* Description: It is combined with hold bits to set the polarity of spi
 * hold line
 * 1: spi will be held when spi hold line is high
 * 0: spi will be held when spi hold line is low
 */

#define SPI_USR_HOLD_POL        (BIT(17))
#define SPI_USR_HOLD_POL_M      (BIT(17))
#define SPI_USR_HOLD_POL_V      0x1
#define SPI_USR_HOLD_POL_S      17

/* SPI_SIO : R/W ;bitpos:[16] ;default: 1'b0 ; */

/* Description: Set the bit to enable 3-line half duplex communication mosi
 * and miso signals share the same pin.
 * 1: enable
 * 0: disable.
 */

#define SPI_SIO                 (BIT(16))
#define SPI_SIO_M               (BIT(16))
#define SPI_SIO_V               0x1
#define SPI_SIO_S               16

/* SPI_FWRITE_QIO : R/W ;bitpos:[15] ;default: 1'b0 ; */

/* Description: In the write operations address phase and read-data phase
 * apply 4 signals.
 */

#define SPI_FWRITE_QIO          (BIT(15))
#define SPI_FWRITE_QIO_M        (BIT(15))
#define SPI_FWRITE_QIO_V        0x1
#define SPI_FWRITE_QIO_S        15

/* SPI_FWRITE_DIO : R/W ;bitpos:[14] ;default: 1'b0 ; */

/* Description: In the write operations address phase and read-data phase
 * apply 2 signals.
 */

#define SPI_FWRITE_DIO          (BIT(14))
#define SPI_FWRITE_DIO_M        (BIT(14))
#define SPI_FWRITE_DIO_V        0x1
#define SPI_FWRITE_DIO_S        14

/* SPI_FWRITE_QUAD : R/W ;bitpos:[13] ;default: 1'b0 ; */

/* Description: In the write operations read-data phase apply 4 signals */

#define SPI_FWRITE_QUAD         (BIT(13))
#define SPI_FWRITE_QUAD_M       (BIT(13))
#define SPI_FWRITE_QUAD_V       0x1
#define SPI_FWRITE_QUAD_S       13

/* SPI_FWRITE_DUAL : R/W ;bitpos:[12] ;default: 1'b0 ; */

/* Description: In the write operations read-data phase apply 2 signals */

#define SPI_FWRITE_DUAL         (BIT(12))
#define SPI_FWRITE_DUAL_M       (BIT(12))
#define SPI_FWRITE_DUAL_V       0x1
#define SPI_FWRITE_DUAL_S       12

/* SPI_WR_BYTE_ORDER : R/W ;bitpos:[11] ;default: 1'b0 ; */

/* Description: In command address write-data (MOSI) phases
 * 1: big-endian
 * 0: litte_endian
 */

#define SPI_WR_BYTE_ORDER       (BIT(11))
#define SPI_WR_BYTE_ORDER_M     (BIT(11))
#define SPI_WR_BYTE_ORDER_V     0x1
#define SPI_WR_BYTE_ORDER_S     11

