apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
/* SPI_RD_BYTE_ORDER : R/W ;bitpos:[10] ;default: 1'b0 ; */

/* Description: In read-data (MISO) phase
 * 1: big-endian
 * 0: little_endian
 */

#define SPI_RD_BYTE_ORDER       (BIT(10))
#define SPI_RD_BYTE_ORDER_M     (BIT(10))
#define SPI_RD_BYTE_ORDER_V     0x1
#define SPI_RD_BYTE_ORDER_S     10

/* SPI_CK_OUT_EDGE : R/W ;bitpos:[7] ;default: 1'b0 ; */

/* Description: the bit combined with spi_mosi_delay_mode bits to set mosi
 * signal delay mode.
 */

#define SPI_CK_OUT_EDGE         (BIT(7))
#define SPI_CK_OUT_EDGE_M       (BIT(7))
#define SPI_CK_OUT_EDGE_V       0x1
#define SPI_CK_OUT_EDGE_S       7

/* SPI_CK_I_EDGE : R/W ;bitpos:[6] ;default: 1'b1 ; */

/* Description: In the slave mode the bit is same as spi_ck_out_edge in
 * master mode. It is combined with  spi_miso_delay_mode bits.
 */

#define SPI_CK_I_EDGE           (BIT(6))
#define SPI_CK_I_EDGE_M         (BIT(6))
#define SPI_CK_I_EDGE_V         0x1
#define SPI_CK_I_EDGE_S         6

/* SPI_CS_SETUP : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: spi cs is enable when ospi is in "prepare" phase.
 * 1: enable
 * 0: disable.
 */

#define SPI_CS_SETUP            (BIT(5))
#define SPI_CS_SETUP_M          (BIT(5))
#define SPI_CS_SETUP_V          0x1
#define SPI_CS_SETUP_S          5

/* SPI_CS_HOLD : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: spi cs keep low when spi is in ¡°done¡± phase.
 * 1: enable
 * 0: disable.
 */

#define SPI_CS_HOLD             (BIT(4))
#define SPI_CS_HOLD_M           (BIT(4))
#define SPI_CS_HOLD_V           0x1
#define SPI_CS_HOLD_S           4

/* SPI_DOUTDIN : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: Set the bit to enable full duplex communication.
 * 1: enable
 * 0: disable.
 */

#define SPI_DOUTDIN             (BIT(0))
#define SPI_DOUTDIN_M           (BIT(0))
#define SPI_DOUTDIN_V           0x1
#define SPI_DOUTDIN_S           0

#define SPI_USER1_OFFSET        (0x20)
#define SPI_USER1_REG(i)        (REG_SPI_BASE(i) + SPI_USER1_OFFSET)

/* SPI_USR_ADDR_BITLEN : RO ;bitpos:[31:26] ;default: 6'd23 ; */

/* Description: The length in bits of address phase. The register value shall
 * be (bit_num-1).
 */

#define SPI_USR_ADDR_BITLEN     0x0000003F
#define SPI_USR_ADDR_BITLEN_M   ((SPI_USR_ADDR_BITLEN_V)<<(SPI_USR_ADDR_BITLEN_S))
#define SPI_USR_ADDR_BITLEN_V   0x3F
#define SPI_USR_ADDR_BITLEN_S   26

/* SPI_USR_DUMMY_CYCLELEN : R/W ;bitpos:[7:0] ;default: 8'd7 ; */

/* Description: The length in spi_clk cycles of dummy phase. The register
 * value shall be (cycle_num-1).
 */

#define SPI_USR_DUMMY_CYCLELEN    0x000000FF
#define SPI_USR_DUMMY_CYCLELEN_M  ((SPI_USR_DUMMY_CYCLELEN_V)<<(SPI_USR_DUMMY_CYCLELEN_S))
#define SPI_USR_DUMMY_CYCLELEN_V  0xFF
#define SPI_USR_DUMMY_CYCLELEN_S  0

#define SPI_USER2_OFFSET        (0x24)
#define SPI_USER2_REG(i)        (REG_SPI_BASE(i) + SPI_USER2_OFFSET)

/* SPI_USR_COMMAND_BITLEN : R/W ;bitpos:[31:28] ;default: 4'd7 ; */

/* Description: The length in bits of command phase. The register value shall
 * be (bit_num-1)
 */

#define SPI_USR_COMMAND_BITLEN    0x0000000F
#define SPI_USR_COMMAND_BITLEN_M  ((SPI_USR_COMMAND_BITLEN_V)<<(SPI_USR_COMMAND_BITLEN_S))
#define SPI_USR_COMMAND_BITLEN_V  0xF
#define SPI_USR_COMMAND_BITLEN_S  28

/* SPI_USR_COMMAND_VALUE : R/W ;bitpos:[15:0] ;default: 16'b0 ; */

/* Description: The value of  command. */

#define SPI_USR_COMMAND_VALUE    0x0000FFFF
#define SPI_USR_COMMAND_VALUE_M  ((SPI_USR_COMMAND_VALUE_V)<<(SPI_USR_COMMAND_VALUE_S))
#define SPI_USR_COMMAND_VALUE_V  0xFFFF
#define SPI_USR_COMMAND_VALUE_S  0

#define SPI_MOSI_DLEN_OFFSET    (0x28)
#define SPI_MOSI_DLEN_REG(i)    (REG_SPI_BASE(i) + SPI_MOSI_DLEN_OFFSET)

/* SPI_USR_MOSI_DBITLEN : R/W ;bitpos:[23:0] ;default: 24'h0 ; */

/* Description: The length in bits of write-data. The register value shall be
 * (bit_num-1).
 */

#define SPI_USR_MOSI_DBITLEN    0x00FFFFFF
#define SPI_USR_MOSI_DBITLEN_M  ((SPI_USR_MOSI_DBITLEN_V)<<(SPI_USR_MOSI_DBITLEN_S))
#define SPI_USR_MOSI_DBITLEN_V  0xFFFFFF
#define SPI_USR_MOSI_DBITLEN_S  0

#define SPI_MISO_DLEN_OFFSET    (0x2C)
#define SPI_MISO_DLEN_REG(i)    (REG_SPI_BASE(i) + SPI_MISO_DLEN_OFFSET)

/* SPI_USR_MISO_DBITLEN : R/W ;bitpos:[23:0] ;default: 24'h0 ; */

/* Description: The length in bits of read-data. The register value shall be
 * (bit_num-1).
 */

#define SPI_USR_MISO_DBITLEN    0x00FFFFFF
#define SPI_USR_MISO_DBITLEN_M  ((SPI_USR_MISO_DBITLEN_V)<<(SPI_USR_MISO_DBITLEN_S))
#define SPI_USR_MISO_DBITLEN_V  0xFFFFFF
#define SPI_USR_MISO_DBITLEN_S  0

#define SPI_SLV_WR_STATUS_OFFSET  (0x30)
#define SPI_SLV_WR_STATUS_REG(i)  (REG_SPI_BASE(i) + SPI_SLV_WR_STATUS_OFFSET)

/* SPI_SLV_WR_ST : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: In the slave mode this register are the status register for
 * the master to write into. In the master mode this register are the higher
 * 32bits in the 64 bits address condition.
 */

#define SPI_SLV_WR_ST           0xFFFFFFFF
#define SPI_SLV_WR_ST_M         ((SPI_SLV_WR_ST_V)<<(SPI_SLV_WR_ST_S))
#define SPI_SLV_WR_ST_V         0xFFFFFFFF
#define SPI_SLV_WR_ST_S         0

#define SPI_PIN_OFFSET          (0x34)
#define SPI_PIN_REG(i)          (REG_SPI_BASE(i) + SPI_PIN_OFFSET)

/* SPI_CS_KEEP_ACTIVE : R/W ;bitpos:[30] ;default: 1'b0 ; */

/* Description: spi cs line keep low when the bit is set. */

#define SPI_CS_KEEP_ACTIVE      (BIT(30))
#define SPI_CS_KEEP_ACTIVE_M    (BIT(30))
#define SPI_CS_KEEP_ACTIVE_V    0x1
#define SPI_CS_KEEP_ACTIVE_S    30

/* SPI_CK_IDLE_EDGE : R/W ;bitpos:[29] ;default: 1'b0 ; */

/* Description:
 * 1: spi clk line is high when idle
 * 0: spi clk line is low when idle.
 */

#define SPI_CK_IDLE_EDGE        (BIT(29))
#define SPI_CK_IDLE_EDGE_M      (BIT(29))
#define SPI_CK_IDLE_EDGE_V      0x1
#define SPI_CK_IDLE_EDGE_S      29

/* SPI_MASTER_CK_SEL : R/W ;bitpos:[13:11] ;default: 3'b0 ; */

/* Description: In the master mode  spi cs line is enable as spi clk  it is
 * combined with spi_cs0_dis spi_cs1_dis spi_cs2_dis.
 */

#define SPI_MASTER_CK_SEL       0x00000007
#define SPI_MASTER_CK_SEL_M     ((SPI_MASTER_CK_SEL_V)<<(SPI_MASTER_CK_SEL_S))
#define SPI_MASTER_CK_SEL_V     0x07
#define SPI_MASTER_CK_SEL_S     11

/* SPI_MASTER_CS_POL : R/W ;bitpos:[8:6] ;default: 3'b0 ; */

/* Description: In the master mode  the bits are the polarity of spi cs
 * line the value is equivalent to spi_cs ^ spi_master_cs_pol.
 */

#define SPI_MASTER_CS_POL       0x00000007
#define SPI_MASTER_CS_POL_M     ((SPI_MASTER_CS_POL_V)<<(SPI_MASTER_CS_POL_S))
#define SPI_MASTER_CS_POL_V     0x7
#define SPI_MASTER_CS_POL_S     6

/* SPI_CK_DIS : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: 1: spi clk out disable  0: spi clk out enable */

#define SPI_CK_DIS              (BIT(5))
#define SPI_CK_DIS_M            (BIT(5))
#define SPI_CK_DIS_V            0x1
#define SPI_CK_DIS_S            5

/* SPI_CS2_DIS : R/W ;bitpos:[2] ;default: 1'b1 ; */

