apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
/* Description: SPI CS2 pin enable, 1: disable CS2, 0: spi_cs2 signal is
 * from/to CS2 pin
 */

#define SPI_CS2_DIS             (BIT(2))
#define SPI_CS2_DIS_M           (BIT(2))
#define SPI_CS2_DIS_V           0x1
#define SPI_CS2_DIS_S           2

/* SPI_CS1_DIS : R/W ;bitpos:[1] ;default: 1'b1 ; */

/* Description: SPI CS1 pin enable, 1: disable CS1, 0: spi_cs1 signal is
 * from/to CS1 pin
 */

#define SPI_CS1_DIS             (BIT(1))
#define SPI_CS1_DIS_M           (BIT(1))
#define SPI_CS1_DIS_V           0x1
#define SPI_CS                  1_DIS_S  1

/* SPI_CS0_DIS : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: SPI CS0 pin enable, 1: disable CS0, 0: spi_cs0 signal is
 * from/to CS0 pin
 */

#define SPI_CS0_DIS             (BIT(0))
#define SPI_CS0_DIS_M           (BIT(0))
#define SPI_CS0_DIS_V           0x1
#define SPI_CS0_DIS_S           0

#define SPI_SLAVE_OFFSET        (0x38)
#define SPI_SLAVE_REG(i)        (REG_SPI_BASE(i) + SPI_SLAVE_OFFSET)

/* SPI_SYNC_RESET : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: Software reset enable, reset the spi clock line cs line
 * and data lines.
 */

#define SPI_SYNC_RESET          (BIT(31))
#define SPI_SYNC_RESET_M        (BIT(31))
#define SPI_SYNC_RESET_V        0x1
#define SPI_SYNC_RESET_S        31

/* SPI_SLAVE_MODE : R/W ;bitpos:[30] ;default: 1'b0 ; */

/* Description:
 * 1: slave mode
 * 0: master mode.
 */

#define SPI_SLAVE_MODE          (BIT(30))
#define SPI_SLAVE_MODE_M        (BIT(30))
#define SPI_SLAVE_MODE_V        0x1
#define SPI_SLAVE_MODE_S        30

/* SPI_SLV_WR_RD_BUF_EN : R/W ;bitpos:[29] ;default: 1'b0 ; */

/* Description: write and read buffer enable in the slave mode */

#define SPI_SLV_WR_RD_BUF_EN    (BIT(29))
#define SPI_SLV_WR_RD_BUF_EN_M  (BIT(29))
#define SPI_SLV_WR_RD_BUF_EN_V  0x1
#define SPI_SLV_WR_RD_BUF_EN_S  29

/* SPI_SLV_WR_RD_STA_EN : R/W ;bitpos:[28] ;default: 1'b0 ; */

/* Description: write and read status enable  in the slave mode */

#define SPI_SLV_WR_RD_STA_EN    (BIT(28))
#define SPI_SLV_WR_RD_STA_EN_M  (BIT(28))
#define SPI_SLV_WR_RD_STA_EN_V  0x1
#define SPI_SLV_WR_RD_STA_EN_S  28

/* SPI_SLV_CMD_DEFINE : R/W ;bitpos:[27] ;default: 1'b0 ; */

/* Description: 1: slave mode commands are defined in SPI_SLAVE3.
 * 0: slave mode commands are fixed as:
 * 1: write-status
 * 2: write-buffer and
 * 3: read-buffer.
 */

#define SPI_SLV_CMD_DEFINE      (BIT(27))
#define SPI_SLV_CMD_DEFINE_M    (BIT(27))
#define SPI_SLV_CMD_DEFINE_V    0x1
#define SPI_SLV_CMD_DEFINE_S    27

/* SPI_TRANS_CNT : RO ;bitpos:[26:23] ;default: 4'b0 ; */

/* Description: The operations counter in both the master mode and the slave
 * mode. 4: read-status
 */

#define SPI_TRANS_CNT  0x0000000F
#define SPI_TRANS_CNT_M         ((SPI_TRANS_CNT_V)<<(SPI_TRANS_CNT_S))
#define SPI_TRANS_CNT_V         0xF
#define SPI_TRANS_CNT_S         23

/* SPI_SLV_LAST_STATE : RO ;bitpos:[22:20] ;default: 3'b0 ; */

/* Description: In the slave mode it is the state of spi state machine. */

#define SPI_SLV_LAST_STATE      0x00000007
#define SPI_SLV_LAST_STATE_M    ((SPI_SLV_LAST_STATE_V)<<(SPI_SLV_LAST_STATE_S))
#define SPI_SLV_LAST_STATE_V    0x7
#define SPI_SLV_LAST_STATE_S    20

/* SPI_SLV_LAST_COMMAND : RO ;bitpos:[19:17] ;default: 3'b0 ; */

/* Description: In the slave mode it is the value of command. */

#define SPI_SLV_LAST_COMMAND    0x00000007
#define SPI_SLV_LAST_COMMAND_M  ((SPI_SLV_LAST_COMMAND_V)<<(SPI_SLV_LAST_COMMAND_S))
#define SPI_SLV_LAST_COMMAND_V  0x7
#define SPI_SLV_LAST_COMMAND_S  17

/* SPI_CS_I_MODE : R/W ;bitpos:[11:10] ;default: 2'b0 ; */

/* Description: In the slave mode  this bits used to synchronize the input
 * spi cs signal and eliminate spi cs jitter.
 */

#define SPI_CS_I_MODE           0x00000003
#define SPI_CS_I_MODE_M         ((SPI_CS_I_MODE_V)<<(SPI_CS_I_MODE_S))
#define SPI_CS_I_MODE_V         0x3
#define SPI_CS_I_MODE_S         10

/* SPI_INT_EN : R/W ;bitpos:[9:5] ;default: 5'b1_0000 ; */

/* Description: Interrupt enable bits for the below 5 sources */

#define SPI_INT_EN              0x0000001F
#define SPI_INT_EN_M            ((SPI_INT_EN_V)<<(SPI_INT_EN_S))
#define SPI_INT_EN_V            0x1F
#define SPI_INT_EN_S            5

/* SPI_TRANS_DONE : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for the completion of any operation
 * in both the master mode and the slave mode.
 */

#define SPI_TRANS_DONE          (BIT(4))
#define SPI_TRANS_DONE_M        (BIT(4))
#define SPI_TRANS_DONE_V        0x1
#define SPI_TRANS_DONE_S        4

/* SPI_SLV_WR_STA_DONE : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for the completion of write-status
 * operation in the slave mode.
 */

#define SPI_SLV_WR_STA_DONE     (BIT(3))
#define SPI_SLV_WR_STA_DONE_M   (BIT(3))
#define SPI_SLV_WR_STA_DONE_V   0x1
#define SPI_SLV_WR_STA_DONE_S   3

/* SPI_SLV_RD_STA_DONE : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for the completion of read-status
 * operation in the slave mode.
 */

#define SPI_SLV_RD_STA_DONE     (BIT(2))
#define SPI_SLV_RD_STA_DONE_M   (BIT(2))
#define SPI_SLV_RD_STA_DONE_V   0x1
#define SPI_SLV_RD_STA_DONE_S   2

/* SPI_SLV_WR_BUF_DONE : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for the completion of write-buffer
 * operation in the slave mode.
 */

#define SPI_SLV_WR_BUF_DONE     (BIT(1))
#define SPI_SLV_WR_BUF_DONE_M   (BIT(1))
#define SPI_SLV_WR_BUF_DONE_V   0x1
#define SPI_SLV_WR_BUF_DONE_S   1

/* SPI_SLV_RD_BUF_DONE : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for the completion of read-buffer
 * operation in the slave mode.
 */

#define SPI_SLV_RD_BUF_DONE     (BIT(0))
#define SPI_SLV_RD_BUF_DONE_M   (BIT(0))
#define SPI_SLV_RD_BUF_DONE_V   0x1
#define SPI_SLV_RD_BUF_DONE_S   0

#define SPI_SLAVE1_OFFSET       (0x3C)
#define SPI_SLAVE1_REG(i)       (REG_SPI_BASE(i) + SPI_SLAVE1_OFFSET)

/* SPI_SLV_STATUS_BITLEN : R/W ;bitpos:[31:27] ;default: 5'b0 ; */

/* Description: In the slave mode it is the length of status bit. */

#define SPI_SLV_STATUS_BITLEN    0x0000001F
#define SPI_SLV_STATUS_BITLEN_M  ((SPI_SLV_STATUS_BITLEN_V)<<(SPI_SLV_STATUS_BITLEN_S))
#define SPI_SLV_STATUS_BITLEN_V  0x1F
#define SPI_SLV_STATUS_BITLEN_S  27

/* SPI_SLV_STATUS_FAST_EN : R/W ;bitpos:[26] ;default: 1'b0 ; */

