apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
/* Description: In the slave mode enable fast read status. */

#define SPI_SLV_STATUS_FAST_EN    (BIT(26))
#define SPI_SLV_STATUS_FAST_EN_M  (BIT(26))
#define SPI_SLV_STATUS_FAST_EN_V  0x1
#define SPI_SLV_STATUS_FAST_EN_S  26

/* SPI_SLV_STATUS_READBACK : R/W ;bitpos:[25] ;default: 1'b1 ; */

/* Description: In the slave mode
 * 1:read register of SPI_SLV_WR_STATUS
 * 0: read register of SPI_RD_STATUS.
 */

#define SPI_SLV_STATUS_READBACK    (BIT(25))
#define SPI_SLV_STATUS_READBACK_M  (BIT(25))
#define SPI_SLV_STATUS_READBACK_V  0x1
#define SPI_SLV_STATUS_READBACK_S  25

/* SPI_SLV_RD_ADDR_BITLEN : R/W ;bitpos:[15:10] ;default: 6'h0 ; */

/* Description: In the slave mode it is the address length in bits for
 * read-buffer operation. The register value shall be (bit_num-1).
 */

#define SPI_SLV_RD_ADDR_BITLEN    0x0000003F
#define SPI_SLV_RD_ADDR_BITLEN_M  ((SPI_SLV_RD_ADDR_BITLEN_V)<<(SPI_SLV_RD_ADDR_BITLEN_S))
#define SPI_SLV_RD_ADDR_BITLEN_V  0x3F
#define SPI_SLV_RD_ADDR_BITLEN_S  10

/* SPI_SLV_WR_ADDR_BITLEN : R/W ;bitpos:[9:4] ;default: 6'h0 ; */

/* Description: In the slave mode it is the address length in bits for
 * write-buffer operation. The register value shall be (bit_num-1).
 */

#define SPI_SLV_WR_ADDR_BITLEN    0x0000003F
#define SPI_SLV_WR_ADDR_BITLEN_M  ((SPI_SLV_WR_ADDR_BITLEN_V)<<(SPI_SLV_WR_ADDR_BITLEN_S))
#define SPI_SLV_WR_ADDR_BITLEN_V  0x3F
#define SPI_SLV_WR_ADDR_BITLEN_S  4

/* SPI_SLV_WRSTA_DUMMY_EN : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: In the slave mode it is the enable bit of dummy phase for
 * write-status operations.
 */

#define SPI_SLV_WRSTA_DUMMY_EN    (BIT(3))
#define SPI_SLV_WRSTA_DUMMY_EN_M  (BIT(3))
#define SPI_SLV_WRSTA_DUMMY_EN_V  0x1
#define SPI_SLV_WRSTA_DUMMY_EN_S  3

/* SPI_SLV_RDSTA_DUMMY_EN : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: In the slave mode it is the enable bit of dummy phase for
 * read-status operations.
 */

#define SPI_SLV_RDSTA_DUMMY_EN    (BIT(2))
#define SPI_SLV_RDSTA_DUMMY_EN_M  (BIT(2))
#define SPI_SLV_RDSTA_DUMMY_EN_V  0x1
#define SPI_SLV_RDSTA_DUMMY_EN_S  2

/* SPI_SLV_WRBUF_DUMMY_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: In the slave mode it is the enable bit of dummy phase for
 * write-buffer operations.
 */

#define SPI_SLV_WRBUF_DUMMY_EN    (BIT(1))
#define SPI_SLV_WRBUF_DUMMY_EN_M  (BIT(1))
#define SPI_SLV_WRBUF_DUMMY_EN_V  0x1
#define SPI_SLV_WRBUF_DUMMY_EN_S  1

/* SPI_SLV_RDBUF_DUMMY_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: In the slave mode it is the enable bit of dummy phase for
 * read-buffer operations.
 */

#define SPI_SLV_RDBUF_DUMMY_EN    (BIT(0))
#define SPI_SLV_RDBUF_DUMMY_EN_M  (BIT(0))
#define SPI_SLV_RDBUF_DUMMY_EN_V  0x1
#define SPI_SLV_RDBUF_DUMMY_EN_S  0

#define SPI_SLAVE2_OFFSET       (0x40)
#define SPI_SLAVE2_REG(i)       (REG_SPI_BASE(i) + SPI_SLAVE2_OFFSET)

/* SPI_SLV_WRBUF_DUMMY_CYCLELEN : R/W ;bitpos:[31:24] ;default: 8'b0 ; */

/* Description: In the slave mode it is the length in spi_clk cycles of dummy
 * phase for write-buffer operations. The register value shall be
 * (cycle_num-1).
 */

#define SPI_SLV_WRBUF_DUMMY_CYCLELEN    0x000000FF
#define SPI_SLV_WRBUF_DUMMY_CYCLELEN_M  ((SPI_SLV_WRBUF_DUMMY_CYCLELEN_V)<<(SPI_SLV_WRBUF_DUMMY_CYCLELEN_S))
#define SPI_SLV_WRBUF_DUMMY_CYCLELEN_V  0xFF
#define SPI_SLV_WRBUF_DUMMY_CYCLELEN_S  24

/* SPI_SLV_RDBUF_DUMMY_CYCLELEN : R/W ;bitpos:[23:16] ;default: 8'h0 ; */

/* Description: In the slave mode it is the length in spi_clk cycles of
 * dummy phase for read-buffer operations. The register value shall be
 * (cycle_num-1).
 */

#define SPI_SLV_RDBUF_DUMMY_CYCLELEN    0x000000FF
#define SPI_SLV_RDBUF_DUMMY_CYCLELEN_M  ((SPI_SLV_RDBUF_DUMMY_CYCLELEN_V)<<(SPI_SLV_RDBUF_DUMMY_CYCLELEN_S))
#define SPI_SLV_RDBUF_DUMMY_CYCLELEN_V  0xFF
#define SPI_SLV_RDBUF_DUMMY_CYCLELEN_S  16

/* SPI_SLV_WRSTA_DUMMY_CYCLELEN : R/W ;bitpos:[15:8] ;default: 8'h0 ; */

/* Description: In the slave mode it is the length in spi_clk cycles of
 * dummy phase for write-status operations. The register value shall be
 * (cycle_num-1).
 */

#define SPI_SLV_WRSTA_DUMMY_CYCLELEN    0x000000FF
#define SPI_SLV_WRSTA_DUMMY_CYCLELEN_M  ((SPI_SLV_WRSTA_DUMMY_CYCLELEN_V)<<(SPI_SLV_WRSTA_DUMMY_CYCLELEN_S))
#define SPI_SLV_WRSTA_DUMMY_CYCLELEN_V  0xFF
#define SPI_SLV_WRSTA_DUMMY_CYCLELEN_S  8

/* SPI_SLV_RDSTA_DUMMY_CYCLELEN : R/W ;bitpos:[7:0] ;default: 8'h0 ; */

/* Description: In the slave mode it is the length in spi_clk cycles of
 * dummy phase for read-status operations. The register value shall be
 * (cycle_num-1).
 */

#define SPI_SLV_RDSTA_DUMMY_CYCLELEN    0x000000FF
#define SPI_SLV_RDSTA_DUMMY_CYCLELEN_M  ((SPI_SLV_RDSTA_DUMMY_CYCLELEN_V)<<(SPI_SLV_RDSTA_DUMMY_CYCLELEN_S))
#define SPI_SLV_RDSTA_DUMMY_CYCLELEN_V  0xFF
#define SPI_SLV_RDSTA_DUMMY_CYCLELEN_S  0

#define SPI_SLAVE3_OFFSET       (0x44)
#define SPI_SLAVE3_REG(i)       (REG_SPI_BASE(i) + SPI_SLAVE3_OFFSET)

/* SPI_SLV_WRSTA_CMD_VALUE : R/W ;bitpos:[31:24] ;default: 8'b0 ; */

/* Description: In the slave mode it is the value of write-status command. */

#define SPI_SLV_WRSTA_CMD_VALUE    0x000000FF
#define SPI_SLV_WRSTA_CMD_VALUE_M  ((SPI_SLV_WRSTA_CMD_VALUE_V)<<(SPI_SLV_WRSTA_CMD_VALUE_S))
#define SPI_SLV_WRSTA_CMD_VALUE_V  0xFF
#define SPI_SLV_WRSTA_CMD_VALUE_S  24

/* SPI_SLV_RDSTA_CMD_VALUE : R/W ;bitpos:[23:16] ;default: 8'b0 ; */

/* Description: In the slave mode it is the value of read-status command. */

#define SPI_SLV_RDSTA_CMD_VALUE    0x000000FF
#define SPI_SLV_RDSTA_CMD_VALUE_M  ((SPI_SLV_RDSTA_CMD_VALUE_V)<<(SPI_SLV_RDSTA_CMD_VALUE_S))
#define SPI_SLV_RDSTA_CMD_VALUE_V  0xFF
#define SPI_SLV_RDSTA_CMD_VALUE_S  16

/* SPI_SLV_WRBUF_CMD_VALUE : R/W ;bitpos:[15:8] ;default: 8'b0 ; */

/* Description: In the slave mode it is the value of write-buffer command. */

#define SPI_SLV_WRBUF_CMD_VALUE    0x000000FF
#define SPI_SLV_WRBUF_CMD_VALUE_M  ((SPI_SLV_WRBUF_CMD_VALUE_V)<<(SPI_SLV_WRBUF_CMD_VALUE_S))
#define SPI_SLV_WRBUF_CMD_VALUE_V  0xFF
#define SPI_SLV_WRBUF_CMD_VALUE_S  8

/* SPI_SLV_RDBUF_CMD_VALUE : R/W ;bitpos:[7:0] ;default: 8'b0 ; */

/* Description: In the slave mode it is the value of read-buffer command. */

