apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
#define SPI_SLV_RDBUF_CMD_VALUE    0x000000FF
#define SPI_SLV_RDBUF_CMD_VALUE_M  ((SPI_SLV_RDBUF_CMD_VALUE_V)<<(SPI_SLV_RDBUF_CMD_VALUE_S))
#define SPI_SLV_RDBUF_CMD_VALUE_V  0xFF
#define SPI_SLV_RDBUF_CMD_VALUE_S  0

#define SPI_SLV_WRBUF_DLEN_OFFSET  (0x48)
#define SPI_SLV_WRBUF_DLEN_REG(i)  (REG_SPI_BASE(i) + SPI_SLV_WRBUF_DLEN_OFFSET)

/* SPI_SLV_WRBUF_DBITLEN : R/W ;bitpos:[23:0] ;default: 24'h0 ; */

/* Description: In the slave mode it is the length in bits for write-buffer
 * operations. The register value shall be (bit_num-1).
 */

#define SPI_SLV_WRBUF_DBITLEN    0x00FFFFFF
#define SPI_SLV_WRBUF_DBITLEN_M  ((SPI_SLV_WRBUF_DBITLEN_V)<<(SPI_SLV_WRBUF_DBITLEN_S))
#define SPI_SLV_WRBUF_DBITLEN_V  0xFFFFFF
#define SPI_SLV_WRBUF_DBITLEN_S  0

#define SPI_SLV_RDBUF_DLEN_OFFSET  (0x4C)
#define SPI_SLV_RDBUF_DLEN_REG(i)  (REG_SPI_BASE(i) + SPI_SLV_RDBUF_DLEN_OFFSET)

/* SPI_SLV_RDBUF_DBITLEN : R/W ;bitpos:[23:0] ;default: 24'h0 ; */

/* Description: In the slave mode it is the length in bits for read-buffer
 * operations. The register value shall be (bit_num-1).
 */

#define SPI_SLV_RDBUF_DBITLEN    0x00FFFFFF
#define SPI_SLV_RDBUF_DBITLEN_M  ((SPI_SLV_RDBUF_DBITLEN_V)<<(SPI_SLV_RDBUF_DBITLEN_S))
#define SPI_SLV_RDBUF_DBITLEN_V  0xFFFFFF
#define SPI_SLV_RDBUF_DBITLEN_S  0

#define SPI_CACHE_FCTRL_OFFSET  (0x50)
#define SPI_CACHE_FCTRL_REG(i)  (REG_SPI_BASE(i) + SPI_CACHE_FCTRL_OFFSET)

/* SPI_CACHE_FLASH_PES_EN : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: For SPI0 spi1 send suspend command before cache read flash
 * 1: enable
 * 0: disable.
 */

#define SPI_CACHE_FLASH_PES_EN    (BIT(3))
#define SPI_CACHE_FLASH_PES_EN_M  (BIT(3))
#define SPI_CACHE_FLASH_PES_EN_V  0x1
#define SPI_CACHE_FLASH_PES_EN_S  3

/* SPI_CACHE_FLASH_USR_CMD : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: For SPI0 cache read flash for user define command
 * 1: enable
 * 0: disable.
 */

#define SPI_CACHE_FLASH_USR_CMD    (BIT(2))
#define SPI_CACHE_FLASH_USR_CMD_M  (BIT(2))
#define SPI_CACHE_FLASH_USR_CMD_V  0x1
#define SPI_CACHE_FLASH_USR_CMD_S  2

/* SPI_CACHE_USR_CMD_4BYTE : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: For SPI0 cache read flash with 4 bytes command
 * 1: enable
 * 0: disable.
 */

#define SPI_CACHE_USR_CMD_4BYTE    (BIT(1))
#define SPI_CACHE_USR_CMD_4BYTE_M  (BIT(1))
#define SPI_CACHE_USR_CMD_4BYTE_V  0x1
#define SPI_CACHE_USR_CMD_4BYTE_S  1

/* SPI_CACHE_REQ_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: For SPI0 Cache access enable
 * 1: enable
 * 0: disable.
 */

#define SPI_CACHE_REQ_EN        (BIT(0))
#define SPI_CACHE_REQ_EN_M      (BIT(0))
#define SPI_CACHE_REQ_EN_V      0x1
#define SPI_CACHE_REQ_EN_S      0

#define SPI_CACHE_SCTRL_OFFSET  (0x54)
#define SPI_CACHE_SCTRL_REG(i)  (REG_SPI_BASE(i) + SPI_CACHE_SCTRL_OFFSET)

/* SPI_CACHE_SRAM_USR_WCMD : R/W ;bitpos:[28] ;default: 1'b1 ; */

/* Description: For SPI0 In the spi sram mode cache write sram for user
 * define command
 */

#define SPI_CACHE_SRAM_USR_WCMD    (BIT(28))
#define SPI_CACHE_SRAM_USR_WCMD_M  (BIT(28))
#define SPI_CACHE_SRAM_USR_WCMD_V  0x1
#define SPI_CACHE_SRAM_USR_WCMD_S  28

/* SPI_SRAM_ADDR_BITLEN : R/W ;bitpos:[27:22] ;default: 6'd23 ; */

/* Description: For SPI0 In the sram mode  it is the length in bits of
 * address phase. The register value shall be (bit_num-1).
 */

#define SPI_SRAM_ADDR_BITLEN    0x0000003F
#define SPI_SRAM_ADDR_BITLEN_M  ((SPI_SRAM_ADDR_BITLEN_V)<<(SPI_SRAM_ADDR_BITLEN_S))
#define SPI_SRAM_ADDR_BITLEN_V  0x3F
#define SPI_SRAM_ADDR_BITLEN_S  22

/* SPI_SRAM_DUMMY_CYCLELEN : R/W ;bitpos:[21:14] ;default: 8'b1 ; */

/* Description: For SPI0 In the sram mode it is the length in bits of address
 * phase. The register value shall be (bit_num-1).
 */

#define SPI_SRAM_DUMMY_CYCLELEN    0x000000FF
#define SPI_SRAM_DUMMY_CYCLELEN_M  ((SPI_SRAM_DUMMY_CYCLELEN_V)<<(SPI_SRAM_DUMMY_CYCLELEN_S))
#define SPI_SRAM_DUMMY_CYCLELEN_V  0xFF
#define SPI_SRAM_DUMMY_CYCLELEN_S  14

/* SPI_SRAM_BYTES_LEN : R/W ;bitpos:[13:6] ;default: 8'b32 ; */

/* Description: For SPI0 In the sram mode it is the byte length of spi read
 * sram data.
 */

#define SPI_SRAM_BYTES_LEN    0x000000FF
#define SPI_SRAM_BYTES_LEN_M  ((SPI_SRAM_BYTES_LEN_V)<<(SPI_SRAM_BYTES_LEN_S))
#define SPI_SRAM_BYTES_LEN_V  0xFF
#define SPI_SRAM_BYTES_LEN_S  6

/* SPI_CACHE_SRAM_USR_RCMD : R/W ;bitpos:[5] ;default: 1'b1 ; */

/* Description: For SPI0  In the spi sram mode cache read sram for user
 * define command.
 */

#define SPI_CACHE_SRAM_USR_RCMD    (BIT(5))
#define SPI_CACHE_SRAM_USR_RCMD_M  (BIT(5))
#define SPI_CACHE_SRAM_USR_RCMD_V  0x1
#define SPI_CACHE_SRAM_USR_RCMD_S  5

/* SPI_USR_RD_SRAM_DUMMY : R/W ;bitpos:[4] ;default: 1'b1 ; */

/* Description: For SPI0  In the spi sram mode  it is the enable bit of dummy
 * phase for read operations.
 */

#define SPI_USR_RD_SRAM_DUMMY    (BIT(4))
#define SPI_USR_RD_SRAM_DUMMY_M  (BIT(4))
#define SPI_USR_RD_SRAM_DUMMY_V  0x1
#define SPI_USR_RD_SRAM_DUMMY_S  4

/* SPI_USR_WR_SRAM_DUMMY : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: For SPI0  In the spi sram mode  it is the enable bit of dummy
 * phase for write operations.
 */

#define SPI_USR_WR_SRAM_DUMMY    (BIT(3))
#define SPI_USR_WR_SRAM_DUMMY_M  (BIT(3))
#define SPI_USR_WR_SRAM_DUMMY_V  0x1
#define SPI_USR_WR_SRAM_DUMMY_S  3

/* SPI_USR_SRAM_QIO : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: For SPI0 In the spi sram mode spi quad I/O mode enable
 * 1: enable
 * 0: disable
 */

#define SPI_USR_SRAM_QIO    (BIT(2))
#define SPI_USR_SRAM_QIO_M  (BIT(2))
#define SPI_USR_SRAM_QIO_V  0x1
#define SPI_USR_SRAM_QIO_S  2

/* SPI_USR_SRAM_DIO : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: For SPI0 In the spi sram mode  spi dual I/O mode enable
 * 1: enable
 * 0: disable
 */

#define SPI_USR_SRAM_DIO    (BIT(1))
#define SPI_USR_SRAM_DIO_M  (BIT(1))
#define SPI_USR_SRAM_DIO_V  0x1
#define SPI_USR_SRAM_DIO_S  1

#define SPI_SRAM_CMD_OFFSET     (0x58)
#define SPI_SRAM_CMD_REG(i)     (REG_SPI_BASE(i) + SPI_SRAM_CMD_OFFSET)

