apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
/* SPI_SRAM_RSTIO : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: For SPI0 SRAM IO mode reset enable. SRAM IO mode reset
 * operation will be triggered when the bit is set. The bit will be cleared
 * once the operation done
 */

#define SPI_SRAM_RSTIO          (BIT(4))
#define SPI_SRAM_RSTIO_M        (BIT(4))
#define SPI_SRAM_RSTIO_V        0x1
#define SPI_SRAM_RSTIO_S        4

/* SPI_SRAM_QIO : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: For SPI0 SRAM QIO mode enable .  SRAM QIO enable command
 * will be send when the bit is set. The bit will be cleared once the
 * operation done.
 */

#define SPI_SRAM_QIO            (BIT(1))
#define SPI_SRAM_QIO_M          (BIT(1))
#define SPI_SRAM_QIO_V          0x1
#define SPI_SRAM_QIO_S          1

/* SPI_SRAM_DIO : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: For SPI0 SRAM DIO mode enable .  SRAM DIO enable command
 * will be send when the bit is set. The bit will be cleared once the
 * operation done.
 */

#define SPI_SRAM_DIO            (BIT(0))
#define SPI_SRAM_DIO_M          (BIT(0))
#define SPI_SRAM_DIO_V          0x1
#define SPI_SRAM_DIO_S          0

#define SPI_SRAM_DRD_CMD_OFFSET (0x5C)
#define SPI_SRAM_DRD_CMD_REG(i) (REG_SPI_BASE(i) + SPI_SRAM_DRD_CMD_OFFSET)

/* SPI_CACHE_SRAM_USR_RD_CMD_BITLEN : R/W ;bitpos:[31:28] ;default: 4'h0 ; */

/* Description: For SPI0 When cache mode is enable it is the length in bits
 * of command phase for SRAM. The register value shall be (bit_num-1).
 */

#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN    0x0000000F
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_M  ((SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_V)<<(SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_S))
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_V  0xF
#define SPI_CACHE_SRAM_USR_RD_CMD_BITLEN_S  28

/* SPI_CACHE_SRAM_USR_RD_CMD_VALUE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */

/* Description: For SPI0 When cache mode is enable it is the read command
 * value of command phase for SRAM.
 */

#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE    0x0000FFFF
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE_M  ((SPI_CACHE_SRAM_USR_RD_CMD_VALUE_V)<<(SPI_CACHE_SRAM_USR_RD_CMD_VALUE_S))
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE_V  0xFFFF
#define SPI_CACHE_SRAM_USR_RD_CMD_VALUE_S  0

#define SPI_SRAM_DWR_CMD_OFFSET          (0x60)
#define SPI_SRAM_DWR_CMD_REG(i)          (REG_SPI_BASE(i) + SPI_SRAM_DWR_CMD_OFFSET)

/* SPI_CACHE_SRAM_USR_WR_CMD_BITLEN : R/W ;bitpos:[31:28] ;default: 4'h0 ; */

/* Description: For SPI0 When cache mode is enable it is the in bits of
 * command phase  for SRAM. The register value shall be (bit_num-1).
 */

#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN    0x0000000F
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_M  ((SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_V)<<(SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_S))
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_V  0xF
#define SPI_CACHE_SRAM_USR_WR_CMD_BITLEN_S  28

/* SPI_CACHE_SRAM_USR_WR_CMD_VALUE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */

/* Description: For SPI0 When cache mode is enable it is the write command
 * value of command phase for SRAM.
 */

#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE    0x0000FFFF
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE_M  ((SPI_CACHE_SRAM_USR_WR_CMD_VALUE_V)<<(SPI_CACHE_SRAM_USR_WR_CMD_VALUE_S))
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE_V  0xFFFF
#define SPI_CACHE_SRAM_USR_WR_CMD_VALUE_S  0

#define SPI_SLV_RD_BIT_OFFSET   (0x64)
#define SPI_SLV_RD_BIT_REG(i)   (REG_SPI_BASE(i) + SPI_SLV_RD_BIT_OFFSET)

/* SPI_SLV_RDATA_BIT : RW ;bitpos:[23:0] ;default: 24'b0 ; */

/* Description: In the slave mode it is the bit length of read data.
 * The value is the length - 1.
 */

#define SPI_SLV_RDATA_BIT       0x00FFFFFF
#define SPI_SLV_RDATA_BIT_M     ((SPI_SLV_RDATA_BIT_V)<<(SPI_SLV_RDATA_BIT_S))
#define SPI_SLV_RDATA_BIT_V     0xFFFFFF
#define SPI_SLV_RDATA_BIT_S     0

#define SPI_W0_OFFSET          (0x80)
#define SPI_W0_REG(i)          (REG_SPI_BASE(i) + SPI_W0_OFFSET)

/* SPI_BUF0 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF0                0xFFFFFFFF
#define SPI_BUF0_M              ((SPI_BUF0_V)<<(SPI_BUF0_S))
#define SPI_BUF0_V              0xFFFFFFFF
#define SPI_BUF0_S              0

#define SPI_W1_OFFSET           (0x84)
#define SPI_W1_REG(i)           (REG_SPI_BASE(i) + SPI_W1_OFFSET)

/* SPI_BUF1 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF1                0xFFFFFFFF
#define SPI_BUF1_M              ((SPI_BUF1_V)<<(SPI_BUF1_S))
#define SPI_BUF1_V              0xFFFFFFFF
#define SPI_BUF1_S              0

#define SPI_W2_OFFSET           (0x88)
#define SPI_W2_REG(i)           (REG_SPI_BASE(i) + SPI_W2_OFFSET)

/* SPI_BUF2 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF2                0xFFFFFFFF
#define SPI_BUF2_M              ((SPI_BUF2_V)<<(SPI_BUF2_S))
#define SPI_BUF2_V              0xFFFFFFFF
#define SPI_BUF2_S              0

#define SPI_W3_OFFSET           (0x8C)
#define SPI_W3_REG(i)           (REG_SPI_BASE(i) + SPI_W3_OFFSET)

/* SPI_BUF3 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF3                0xFFFFFFFF
#define SPI_BUF3_M              ((SPI_BUF3_V)<<(SPI_BUF3_S))
#define SPI_BUF3_V              0xFFFFFFFF
#define SPI_BUF3_S              0

#define SPI_W4_OFFSET           (0x90)
#define SPI_W4_REG(i)           (REG_SPI_BASE(i) + SPI_W4_OFFSET)

/* SPI_BUF4 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF4                0xFFFFFFFF
#define SPI_BUF4_M              ((SPI_BUF4_V)<<(SPI_BUF4_S))
#define SPI_BUF4_V              0xFFFFFFFF
#define SPI_BUF4_S              0

#define SPI_W5_OFFSET           (0x94)
#define SPI_W5_REG(i)           (REG_SPI_BASE(i) + SPI_W5_OFFSET)

/* SPI_BUF5 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF5                0xFFFFFFFF
#define SPI_BUF5_M              ((SPI_BUF5_V)<<(SPI_BUF5_S))
#define SPI_BUF5_V              0xFFFFFFFF
#define SPI_BUF5_S              0

#define SPI_W6_OFFSET           (0x98)
#define SPI_W6_REG(i)           (REG_SPI_BASE(i) + SPI_W6_OFFSET)

/* SPI_BUF6 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF6                0xFFFFFFFF
#define SPI_BUF6_M              ((SPI_BUF6_V)<<(SPI_BUF6_S))
#define SPI_BUF6_V              0xFFFFFFFF
#define SPI_BUF6_S              0

#define SPI_W7_OFFSET           (0x9C)
#define SPI_W7_REG(i)           (REG_SPI_BASE(i) + SPI_W7_OFFSET)

