apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
/* SPI_BUF7 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF7                0xFFFFFFFF
#define SPI_BUF7_M              ((SPI_BUF7_V)<<(SPI_BUF7_S))
#define SPI_BUF7_V              0xFFFFFFFF
#define SPI_BUF7_S              0

#define SPI_W8_OFFSET           (0xA0)
#define SPI_W8_REG(i)           (REG_SPI_BASE(i) + SPI_W8_OFFSET)

/* SPI_BUF8 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF8                0xFFFFFFFF
#define SPI_BUF8_M              ((SPI_BUF8_V)<<(SPI_BUF8_S))
#define SPI_BUF8_V              0xFFFFFFFF
#define SPI_BUF8_S              0

#define SPI_W9_OFFSET           (0xA4)
#define SPI_W9_REG(i)           (REG_SPI_BASE(i) + SPI_W9_OFFSET)

/* SPI_BUF9 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF9                0xFFFFFFFF
#define SPI_BUF9_M              ((SPI_BUF9_V)<<(SPI_BUF9_S))
#define SPI_BUF9_V              0xFFFFFFFF
#define SPI_BUF9_S              0

#define SPI_W10_OFFSET          (0xA8)
#define SPI_W10_REG(i)          (REG_SPI_BASE(i) + SPI_W10_OFFSET)

/* SPI_BUF10 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF10               0xFFFFFFFF
#define SPI_BUF10_M             ((SPI_BUF10_V)<<(SPI_BUF10_S))
#define SPI_BUF10_V             0xFFFFFFFF
#define SPI_BUF10_S             0

#define SPI_W11_OFFSET          (0xAC)
#define SPI_W11_REG(i)          (REG_SPI_BASE(i) + SPI_W11_OFFSET)

/* SPI_BUF11 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF11               0xFFFFFFFF
#define SPI_BUF11_M             ((SPI_BUF11_V)<<(SPI_BUF11_S))
#define SPI_BUF11_V             0xFFFFFFFF
#define SPI_BUF11_S             0

#define SPI_W12_OFFSET          (0xB0)
#define SPI_W12_REG(i)          (REG_SPI_BASE(i) + SPI_W12_OFFSET)

/* SPI_BUF12 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF12               0xFFFFFFFF
#define SPI_BUF12_M             ((SPI_BUF12_V)<<(SPI_BUF12_S))
#define SPI_BUF12_V             0xFFFFFFFF
#define SPI_BUF12_S             0

#define SPI_W13_OFFSET          (0xB4)
#define SPI_W13_REG(i)          (REG_SPI_BASE(i) + SPI_W13_OFFSET)

/* SPI_BUF13 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF13               0xFFFFFFFF
#define SPI_BUF13_M             ((SPI_BUF13_V)<<(SPI_BUF13_S))
#define SPI_BUF13_V             0xFFFFFFFF
#define SPI_BUF13_S             0

#define SPI_W14_OFFSET          (0xB8)
#define SPI_W14_REG(i)          (REG_SPI_BASE(i) + SPI_W14_OFFSET)

/* SPI_BUF14 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF14               0xFFFFFFFF
#define SPI_BUF14_M             ((SPI_BUF14_V)<<(SPI_BUF14_S))
#define SPI_BUF14_V             0xFFFFFFFF
#define SPI_BUF14_S             0

#define SPI_W15_OFFSET          (0xBC)
#define SPI_W15_REG(i)          (REG_SPI_BASE(i) + SPI_W15_OFFSET)

/* SPI_BUF15 : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: data buffer */

#define SPI_BUF15               0xFFFFFFFF
#define SPI_BUF15_M             ((SPI_BUF15_V)<<(SPI_BUF15_S))
#define SPI_BUF15_V             0xFFFFFFFF
#define SPI_BUF15_S             0

#define SPI_TX_CRC_OFFSET       (0xC0)
#define SPI_TX_CRC_REG(i)       (REG_SPI_BASE(i) + SPI_TX_CRC_OFFSET)

/* SPI_TX_CRC_DATA : R/W ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: For SPI1  the value of crc32 for 256 bits data. */

#define SPI_TX_CRC_DATA         0xFFFFFFFF
#define SPI_TX_CRC_DATA_M       ((SPI_TX_CRC_DATA_V)<<(SPI_TX_CRC_DATA_S))
#define SPI_TX_CRC_DATA_V       0xFFFFFFFF
#define SPI_TX_CRC_DATA_S       0

#define SPI_EXT0_OFFSET         (0xF0)
#define SPI_EXT0_REG(i)         (REG_SPI_BASE(i) + SPI_EXT0_OFFSET)

/* SPI_T_PP_ENA : R/W ;bitpos:[31] ;default: 1'b1 ; */

/* Description: page program delay enable. */

#define SPI_T_PP_ENA            (BIT(31))
#define SPI_T_PP_ENA_M          (BIT(31))
#define SPI_T_PP_ENA_V          0x1
#define SPI_T_PP_ENA_S          31

/* SPI_T_PP_SHIFT : R/W ;bitpos:[19:16] ;default: 4'd10 ; */

/* Description: page program delay time shift. */

#define SPI_T_PP_SHIFT          0x0000000F
#define SPI_T_PP_SHIFT_M        ((SPI_T_PP_SHIFT_V)<<(SPI_T_PP_SHIFT_S))
#define SPI_T_PP_SHIFT_V        0xF
#define SPI_T_PP_SHIFT_S        16

/* SPI_T_PP_TIME : R/W ;bitpos:[11:0] ;default: 12'd80 ; */

/* Description: page program delay time by system clock. */

#define SPI_T_PP_TIME           0x00000FFF
#define SPI_T_PP_TIME_M         ((SPI_T_PP_TIME_V)<<(SPI_T_PP_TIME_S))
#define SPI_T_PP_TIME_V         0xFFF
#define SPI_T_PP_TIME_S         0

#define SPI_EXT1_OFFSET         (0xF4)
#define SPI_EXT1_REG(i)         (REG_SPI_BASE(i) + SPI_EXT1_OFFSET)

/* SPI_T_ERASE_ENA : R/W ;bitpos:[31] ;default: 1'b1 ; */

/* Description: erase flash delay enable. */

#define SPI_T_ERASE_ENA         (BIT(31))
#define SPI_T_ERASE_ENA_M       (BIT(31))
#define SPI_T_ERASE_ENA_V       0x1
#define SPI_T_ERASE_ENA_S       31

/* SPI_T_ERASE_SHIFT : R/W ;bitpos:[19:16] ;default: 4'd15 ; */

/* Description: erase flash delay time shift. */

#define SPI_T_ERASE_SHIFT       0x0000000F
#define SPI_T_ERASE_SHIFT_M     ((SPI_T_ERASE_SHIFT_V)<<(SPI_T_ERASE_SHIFT_S))
#define SPI_T_ERASE_SHIFT_V     0xF
#define SPI_T_ERASE_SHIFT_S     16

/* SPI_T_ERASE_TIME : R/W ;bitpos:[11:0] ;default: 12'd0 ; */

/* Description: erase flash delay time by system clock. */

#define SPI_T_ERASE_TIME        0x00000FFF
#define SPI_T_ERASE_TIME_M      ((SPI_T_ERASE_TIME_V)<<(SPI_T_ERASE_TIME_S))
#define SPI_T_ERASE_TIME_V      0xFFF
#define SPI_T_ERASE_TIME_S      0

#define SPI_EXT2_OFFSET         (0xF8)
#define SPI_EXT2_REG(i)         (REG_SPI_BASE(i) + SPI_EXT2_OFFSET)

/* SPI_ST : RO ;bitpos:[2:0] ;default: 3'b0 ; */

/* Description: The status of spi state machine. */

#define SPI_ST                  0x00000007
#define SPI_ST_M                ((SPI_ST_V)<<(SPI_ST_S))
#define SPI_ST_V                0x7
#define SPI_ST_S                0

#define SPI_EXT3_OFFSET         (0xFC)
#define SPI_EXT3_REG(i)         (REG_SPI_BASE(i) + SPI_EXT3_OFFSET)

/* SPI_INT_HOLD_ENA : R/W ;bitpos:[1:0] ;default: 2'b0 ; */

/* Description: This register is for two SPI masters to share the same cs
 * clock and data signals. The bits of one SPI are set if the other SPI is
 * busy the SPI will be hold.
 * 1(3): hold at "idle" phase
 * 2: hold at "prepare" phase.
 */

