apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
#define SPI_INT_HOLD_ENA        0x00000003
#define SPI_INT_HOLD_ENA_M      ((SPI_INT_HOLD_ENA_V)<<(SPI_INT_HOLD_ENA_S))
#define SPI_INT_HOLD_ENA_V      0x3
#define SPI_INT_HOLD_ENA_S      0

#define SPI_DMA_CONF_OFFSET     (0x100)
#define SPI_DMA_CONF_REG(i)     (REG_SPI_BASE(i) + SPI_DMA_CONF_OFFSET)

/* SPI_DMA_CONTINUE : R/W ;bitpos:[16] ;default: 1'b0 ; */

/* Description: spi dma continue tx/rx data. */

#define SPI_DMA_CONTINUE        (BIT(16))
#define SPI_DMA_CONTINUE_M      (BIT(16))
#define SPI_DMA_CONTINUE_V      0x1
#define SPI_DMA_CONTINUE_S      16

/* SPI_DMA_TX_STOP : R/W ;bitpos:[15] ;default: 1'b0 ; */

/* Description: spi dma write data stop when in continue tx/rx mode. */

#define SPI_DMA_TX_STOP         (BIT(15))
#define SPI_DMA_TX_STOP_M       (BIT(15))
#define SPI_DMA_TX_STOP_V       0x1
#define SPI_DMA_TX_STOP_S       15

/* SPI_DMA_RX_STOP : R/W ;bitpos:[14] ;default: 1'b0 ; */

/* Description: spi dma read data stop when in continue tx/rx mode. */

#define SPI_DMA_RX_STOP         (BIT(14))
#define SPI_DMA_RX_STOP_M       (BIT(14))
#define SPI_DMA_RX_STOP_V       0x1
#define SPI_DMA_RX_STOP_S       14

/* SPI_OUT_DATA_BURST_EN : R/W ;bitpos:[12] ;default: 1'b0 ; */

/* Description: spi dma read data from memory in burst mode. */

#define SPI_OUT_DATA_BURST_EN    (BIT(12))
#define SPI_OUT_DATA_BURST_EN_M  (BIT(12))
#define SPI_OUT_DATA_BURST_EN_V  0x1
#define SPI_OUT_DATA_BURST_EN_S  12

/* SPI_INDSCR_BURST_EN : R/W ;bitpos:[11] ;default: 1'b0 ; */

/* Description: read descriptor use burst mode when write data to memory. */

#define SPI_INDSCR_BURST_EN    (BIT(11))
#define SPI_INDSCR_BURST_EN_M  (BIT(11))
#define SPI_INDSCR_BURST_EN_V  0x1
#define SPI_INDSCR_BURST_EN_S  11

/* SPI_OUTDSCR_BURST_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */

/* Description: read descriptor use burst mode when read data for memory. */

#define SPI_OUTDSCR_BURST_EN    (BIT(10))
#define SPI_OUTDSCR_BURST_EN_M  (BIT(10))
#define SPI_OUTDSCR_BURST_EN_V  0x1
#define SPI_OUTDSCR_BURST_EN_S  10

/* SPI_OUT_EOF_MODE : R/W ;bitpos:[9] ;default: 1'b1 ; */

/* Description: out eof flag generation mode.
 * 1: when dma pop all data from fifo
 * 0: when ahb push all data to fifo.
 */

#define SPI_OUT_EOF_MODE        (BIT(9))
#define SPI_OUT_EOF_MODE_M      (BIT(9))
#define SPI_OUT_EOF_MODE_V      0x1
#define SPI_OUT_EOF_MODE_S      9

/* SPI_OUT_AUTO_WRBACK : R/W ;bitpos:[8] ;default: 1'b0 ; */

/* Description: when the link is empty jump to next automatically. */

#define SPI_OUT_AUTO_WRBACK     (BIT(8))
#define SPI_OUT_AUTO_WRBACK_M   (BIT(8))
#define SPI_OUT_AUTO_WRBACK_V   0x1
#define SPI_OUT_AUTO_WRBACK_S   8

/* SPI_OUT_LOOP_TEST : R/W ;bitpos:[7] ;default: 1'b0 ; */

/* Description: Set bit to test out link. */

#define SPI_OUT_LOOP_TEST       (BIT(7))
#define SPI_OUT_LOOP_TEST_M     (BIT(7))
#define SPI_OUT_LOOP_TEST_V     0x1
#define SPI_OUT_LOOP_TEST_S     7

/* SPI_IN_LOOP_TEST : R/W ;bitpos:[6] ;default: 1'b0 ; */

/* Description: Set bit to test in link. */

#define SPI_IN_LOOP_TEST        (BIT(6))
#define SPI_IN_LOOP_TEST_M      (BIT(6))
#define SPI_IN_LOOP_TEST_V      0x1
#define SPI_IN_LOOP_TEST_S      6

/* SPI_AHBM_RST : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: reset spi dma ahb master. */

#define SPI_AHBM_RST            (BIT(5))
#define SPI_AHBM_RST_M          (BIT(5))
#define SPI_AHBM_RST_V          0x1
#define SPI_AHBM_RST_S          5

/* SPI_AHBM_FIFO_RST : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: reset spi dma ahb master fifo pointer. */

#define SPI_AHBM_FIFO_RST       (BIT(4))
#define SPI_AHBM_FIFO_RST_M     (BIT(4))
#define SPI_AHBM_FIFO_RST_V     0x1
#define SPI_AHBM_FIFO_RST_S     4

/* SPI_OUT_RST : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The bit is used to reset out dma fsm and out data fifo
 * pointer.
 */

#define SPI_OUT_RST             (BIT(3))
#define SPI_OUT_RST_M           (BIT(3))
#define SPI_OUT_RST_V           0x1
#define SPI_OUT_RST_S           3

/* SPI_IN_RST : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The bit is used to reset in dma fsm and in data fifo
 * pointer.
 */

#define SPI_IN_RST              (BIT(2))
#define SPI_IN_RST_M            (BIT(2))
#define SPI_IN_RST_V            0x1
#define SPI_IN_RST_S            2

#define SPI_DMA_OUT_LINK_OFFSET (0x104)
#define SPI_DMA_OUT_LINK_REG(i) (REG_SPI_BASE(i) + SPI_DMA_OUT_LINK_OFFSET)

/* SPI_OUTLINK_RESTART : R/W ;bitpos:[30] ;default: 1'b0 ; */

/* Description: Set the bit to mount on new outlink descriptors. */

#define SPI_OUTLINK_RESTART     (BIT(30))
#define SPI_OUTLINK_RESTART_M   (BIT(30))
#define SPI_OUTLINK_RESTART_V   0x1
#define SPI_OUTLINK_RESTART_S   30

/* SPI_OUTLINK_START : R/W ;bitpos:[29] ;default: 1'b0 ; */

/* Description: Set the bit to start to use outlink descriptor. */

#define SPI_OUTLINK_START       (BIT(29))
#define SPI_OUTLINK_START_M     (BIT(29))
#define SPI_OUTLINK_START_V     0x1
#define SPI_OUTLINK_START_S     29

/* SPI_OUTLINK_STOP : R/W ;bitpos:[28] ;default: 1'b0 ; */

/* Description: Set the bit to stop to use outlink descriptor. */

#define SPI_OUTLINK_STOP        (BIT(28))
#define SPI_OUTLINK_STOP_M      (BIT(28))
#define SPI_OUTLINK_STOP_V      0x1
#define SPI_OUTLINK_STOP_S      28

/* SPI_OUTLINK_ADDR : R/W ;bitpos:[19:0] ;default: 20'h0 ; */

/* Description: The address of the first outlink descriptor. */

#define SPI_OUTLINK_ADDR        0x000FFFFF
#define SPI_OUTLINK_ADDR_M      ((SPI_OUTLINK_ADDR_V)<<(SPI_OUTLINK_ADDR_S))
#define SPI_OUTLINK_ADDR_V      0xFFFFF
#define SPI_OUTLINK_ADDR_S      0

#define SPI_DMA_IN_LINK_OFFSET  (0x108)
#define SPI_DMA_IN_LINK_REG(i)  (REG_SPI_BASE(i) + SPI_DMA_IN_LINK_OFFSET)

/* SPI_INLINK_RESTART : R/W ;bitpos:[30] ;default: 1'b0 ; */

/* Description: Set the bit to mount on new inlink descriptors. */

#define SPI_INLINK_RESTART      (BIT(30))
#define SPI_INLINK_RESTART_M    (BIT(30))
#define SPI_INLINK_RESTART_V    0x1
#define SPI_INLINK_RESTART_S    30

/* SPI_INLINK_START : R/W ;bitpos:[29] ;default: 1'b0 ; */

/* Description: Set the bit to start to use inlink descriptor. */

