apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
#define SPI_INLINK_START        (BIT(29))
#define SPI_INLINK_START_M      (BIT(29))
#define SPI_INLINK_START_V      0x1
#define SPI_INLINK_START_S      29

/* SPI_INLINK_STOP : R/W ;bitpos:[28] ;default: 1'b0 ; */

/* Description: Set the bit to stop to use inlink descriptor. */

#define SPI_INLINK_STOP         (BIT(28))
#define SPI_INLINK_STOP_M       (BIT(28))
#define SPI_INLINK_STOP_V       0x1
#define SPI_INLINK_STOP_S       28

/* SPI_INLINK_AUTO_RET : R/W ;bitpos:[20] ;default: 1'b0 ; */

/* Description: when the bit is set  inlink descriptor returns to the next
 * descriptor while a packet is wrong
 */

#define SPI_INLINK_AUTO_RET     (BIT(20))
#define SPI_INLINK_AUTO_RET_M   (BIT(20))
#define SPI_INLINK_AUTO_RET_V   0x1
#define SPI_INLINK_AUTO_RET_S   20

/* SPI_INLINK_ADDR : R/W ;bitpos:[19:0] ;default: 20'h0 ; */

/* Description: The address of the first inlink descriptor. */

#define SPI_INLINK_ADDR         0x000FFFFF
#define SPI_INLINK_ADDR_M       ((SPI_INLINK_ADDR_V)<<(SPI_INLINK_ADDR_S))
#define SPI_INLINK_ADDR_V       0xFFFFF
#define SPI_INLINK_ADDR_S       0

#define SPI_DMA_STATUS_OFFSET   (0x10C)
#define SPI_DMA_STATUS_REG(i)   (REG_SPI_BASE(i) + SPI_DMA_STATUS_OFFSET)

/* SPI_DMA_TX_EN : RO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: spi dma write data status bit. */

#define SPI_DMA_TX_EN           (BIT(1))
#define SPI_DMA_TX_EN_M         (BIT(1))
#define SPI_DMA_TX_EN_V         0x1
#define SPI_DMA_TX_EN_S         1

/* SPI_DMA_RX_EN : RO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: spi dma read data status bit. */

#define SPI_DMA_RX_EN           (BIT(0))
#define SPI_DMA_RX_EN_M         (BIT(0))
#define SPI_DMA_RX_EN_V         0x1
#define SPI_DMA_RX_EN_S         0

#define SPI_DMA_INT_ENA_OFFSET  (0x110)
#define SPI_DMA_INT_ENA_REG(i)  (REG_SPI_BASE(i) + SPI_DMA_INT_ENA_OFFSET)

/* SPI_OUT_TOTAL_EOF_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */

/* Description: The enable bit for sending all the packets to host done. */

#define SPI_OUT_TOTAL_EOF_INT_ENA    (BIT(8))
#define SPI_OUT_TOTAL_EOF_INT_ENA_M  (BIT(8))
#define SPI_OUT_TOTAL_EOF_INT_ENA_V  0x1
#define SPI_OUT_TOTAL_EOF_INT_ENA_S  8

/* SPI_OUT_EOF_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */

/* Description: The enable bit for sending a packet to host done. */

#define SPI_OUT_EOF_INT_ENA     (BIT(7))
#define SPI_OUT_EOF_INT_ENA_M   (BIT(7))
#define SPI_OUT_EOF_INT_ENA_V   0x1
#define SPI_OUT_EOF_INT_ENA_S   7

/* SPI_OUT_DONE_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */

/* Description: The enable bit for completing usage of a outlink
 * descriptor.
 */

#define SPI_OUT_DONE_INT_ENA    (BIT(6))
#define SPI_OUT_DONE_INT_ENA_M  (BIT(6))
#define SPI_OUT_DONE_INT_ENA_V  0x1
#define SPI_OUT_DONE_INT_ENA_S  6

/* SPI_IN_SUC_EOF_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: The enable bit for completing receiving all the packets from
 * host.
 */

#define SPI_IN_SUC_EOF_INT_ENA    (BIT(5))
#define SPI_IN_SUC_EOF_INT_ENA_M  (BIT(5))
#define SPI_IN_SUC_EOF_INT_ENA_V  0x1
#define SPI_IN_SUC_EOF_INT_ENA_S  5

/* SPI_IN_ERR_EOF_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The enable bit for receiving error. */

#define SPI_IN_ERR_EOF_INT_ENA    (BIT(4))
#define SPI_IN_ERR_EOF_INT_ENA_M  (BIT(4))
#define SPI_IN_ERR_EOF_INT_ENA_V  0x1
#define SPI_IN_ERR_EOF_INT_ENA_S  4

/* SPI_IN_DONE_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The enable bit for completing usage of a inlink descriptor. */

#define SPI_IN_DONE_INT_ENA    (BIT(3))
#define SPI_IN_DONE_INT_ENA_M  (BIT(3))
#define SPI_IN_DONE_INT_ENA_V  0x1
#define SPI_IN_DONE_INT_ENA_S  3

/* SPI_INLINK_DSCR_ERROR_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The enable bit for inlink descriptor error. */

#define SPI_INLINK_DSCR_ERROR_INT_ENA    (BIT(2))
#define SPI_INLINK_DSCR_ERROR_INT_ENA_M  (BIT(2))
#define SPI_INLINK_DSCR_ERROR_INT_ENA_V  0x1
#define SPI_INLINK_DSCR_ERROR_INT_ENA_S  2

/* SPI_OUTLINK_DSCR_ERROR_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The enable bit for outlink descriptor error. */

#define SPI_OUTLINK_DSCR_ERROR_INT_ENA    (BIT(1))
#define SPI_OUTLINK_DSCR_ERROR_INT_ENA_M  (BIT(1))
#define SPI_OUTLINK_DSCR_ERROR_INT_ENA_V  0x1
#define SPI_OUTLINK_DSCR_ERROR_INT_ENA_S  1

/* SPI_INLINK_DSCR_EMPTY_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: The enable bit for lack of enough inlink descriptors. */

#define SPI_INLINK_DSCR_EMPTY_INT_ENA    (BIT(0))
#define SPI_INLINK_DSCR_EMPTY_INT_ENA_M  (BIT(0))
#define SPI_INLINK_DSCR_EMPTY_INT_ENA_V  0x1
#define SPI_INLINK_DSCR_EMPTY_INT_ENA_S  0

#define SPI_DMA_INT_RAW_OFFSET  (0x114)
#define SPI_DMA_INT_RAW_REG(i)  (REG_SPI_BASE(i) + SPI_DMA_INT_RAW_OFFSET)

/* SPI_OUT_TOTAL_EOF_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */

/* Description: The raw bit for sending all the packets to host done. */

#define SPI_OUT_TOTAL_EOF_INT_RAW    (BIT(8))
#define SPI_OUT_TOTAL_EOF_INT_RAW_M  (BIT(8))
#define SPI_OUT_TOTAL_EOF_INT_RAW_V  0x1
#define SPI_OUT_TOTAL_EOF_INT_RAW_S  8

/* SPI_OUT_EOF_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */

/* Description: The raw bit for sending a packet to host done. */

#define SPI_OUT_EOF_INT_RAW    (BIT(7))
#define SPI_OUT_EOF_INT_RAW_M  (BIT(7))
#define SPI_OUT_EOF_INT_RAW_V  0x1
#define SPI_OUT_EOF_INT_RAW_S  7

/* SPI_OUT_DONE_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */

/* Description: The raw bit for completing usage of a outlink descriptor. */
#define SPI_OUT_DONE_INT_RAW    (BIT(6))
#define SPI_OUT_DONE_INT_RAW_M  (BIT(6))
#define SPI_OUT_DONE_INT_RAW_V  0x1
#define SPI_OUT_DONE_INT_RAW_S  6

/* SPI_IN_SUC_EOF_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */

/* Description: The raw bit for completing receiving all the packets from
 * host.
 */

#define SPI_IN_SUC_EOF_INT_RAW    (BIT(5))
#define SPI_IN_SUC_EOF_INT_RAW_M  (BIT(5))
#define SPI_IN_SUC_EOF_INT_RAW_V  0x1
#define SPI_IN_SUC_EOF_INT_RAW_S  5

/* SPI_IN_ERR_EOF_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The raw bit for receiving error. */

