apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
#define SPI_IN_ERR_EOF_INT_RAW    (BIT(4))
#define SPI_IN_ERR_EOF_INT_RAW_M  (BIT(4))
#define SPI_IN_ERR_EOF_INT_RAW_V  0x1
#define SPI_IN_ERR_EOF_INT_RAW_S  4

/* SPI_IN_DONE_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The raw bit for completing usage of a inlink descriptor. */

#define SPI_IN_DONE_INT_RAW     (BIT(3))
#define SPI_IN_DONE_INT_RAW_M   (BIT(3))
#define SPI_IN_DONE_INT_RAW_V   0x1
#define SPI_IN_DONE_INT_RAW_S   3

/* SPI_INLINK_DSCR_ERROR_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The raw bit for inlink descriptor error. */

#define SPI_INLINK_DSCR_ERROR_INT_RAW    (BIT(2))
#define SPI_INLINK_DSCR_ERROR_INT_RAW_M  (BIT(2))
#define SPI_INLINK_DSCR_ERROR_INT_RAW_V  0x1
#define SPI_INLINK_DSCR_ERROR_INT_RAW_S  2

/* SPI_OUTLINK_DSCR_ERROR_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The raw bit for outlink descriptor error. */

#define SPI_OUTLINK_DSCR_ERROR_INT_RAW    (BIT(1))
#define SPI_OUTLINK_DSCR_ERROR_INT_RAW_M  (BIT(1))
#define SPI_OUTLINK_DSCR_ERROR_INT_RAW_V  0x1
#define SPI_OUTLINK_DSCR_ERROR_INT_RAW_S  1

/* SPI_INLINK_DSCR_EMPTY_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: The raw bit for lack of enough inlink descriptors. */

#define SPI_INLINK_DSCR_EMPTY_INT_RAW    (BIT(0))
#define SPI_INLINK_DSCR_EMPTY_INT_RAW_M  (BIT(0))
#define SPI_INLINK_DSCR_EMPTY_INT_RAW_V  0x1
#define SPI_INLINK_DSCR_EMPTY_INT_RAW_S  0

#define SPI_DMA_INT_ST_OFFSET   (0x118)
#define SPI_DMA_INT_ST_REG(i)   (REG_SPI_BASE(i) + SPI_DMA_INT_ST_OFFSET)

/* SPI_OUT_TOTAL_EOF_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */

/* Description: The status bit for sending all the packets to host done. */

#define SPI_OUT_TOTAL_EOF_INT_ST    (BIT(8))
#define SPI_OUT_TOTAL_EOF_INT_ST_M  (BIT(8))
#define SPI_OUT_TOTAL_EOF_INT_ST_V  0x1
#define SPI_OUT_TOTAL_EOF_INT_ST_S  8

/* SPI_OUT_EOF_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */

/* Description: The status bit for sending a packet to host done. */

#define SPI_OUT_EOF_INT_ST      (BIT(7))
#define SPI_OUT_EOF_INT_ST_M    (BIT(7))
#define SPI_OUT_EOF_INT_ST_V    0x1
#define SPI_OUT_EOF_INT_ST_S    7

/* SPI_OUT_DONE_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */

/* Description: The status bit for completing usage of a outlink descriptor */

#define SPI_OUT_DONE_INT_ST     (BIT(6))
#define SPI_OUT_DONE_INT_ST_M   (BIT(6))
#define SPI_OUT_DONE_INT_ST_V   0x1
#define SPI_OUT_DONE_INT_ST_S   6

/* SPI_IN_SUC_EOF_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */

/* Description: The status bit for completing receiving all the packets from
 * host.
 */

#define SPI_IN_SUC_EOF_INT_ST    (BIT(5))
#define SPI_IN_SUC_EOF_INT_ST_M  (BIT(5))
#define SPI_IN_SUC_EOF_INT_ST_V  0x1
#define SPI_IN_SUC_EOF_INT_ST_S  5

/* SPI_IN_ERR_EOF_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The status bit for receiving error. */

#define SPI_IN_ERR_EOF_INT_ST    (BIT(4))
#define SPI_IN_ERR_EOF_INT_ST_M  (BIT(4))
#define SPI_IN_ERR_EOF_INT_ST_V  0x1
#define SPI_IN_ERR_EOF_INT_ST_S  4

/* SPI_IN_DONE_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The status bit for completing usage of a inlink descriptor. */

#define SPI_IN_DONE_INT_ST      (BIT(3))
#define SPI_IN_DONE_INT_ST_M    (BIT(3))
#define SPI_IN_DONE_INT_ST_V    0x1
#define SPI_IN_DONE_INT_ST_S    3

/* SPI_INLINK_DSCR_ERROR_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The status bit for inlink descriptor error. */

#define SPI_INLINK_DSCR_ERROR_INT_ST    (BIT(2))
#define SPI_INLINK_DSCR_ERROR_INT_ST_M  (BIT(2))
#define SPI_INLINK_DSCR_ERROR_INT_ST_V  0x1
#define SPI_INLINK_DSCR_ERROR_INT_ST_S  2

/* SPI_OUTLINK_DSCR_ERROR_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The status bit for outlink descriptor error. */

#define SPI_OUTLINK_DSCR_ERROR_INT_ST    (BIT(1))
#define SPI_OUTLINK_DSCR_ERROR_INT_ST_M  (BIT(1))
#define SPI_OUTLINK_DSCR_ERROR_INT_ST_V  0x1
#define SPI_OUTLINK_DSCR_ERROR_INT_ST_S  1

/* SPI_INLINK_DSCR_EMPTY_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: The status bit for lack of enough inlink descriptors. */

#define SPI_INLINK_DSCR_EMPTY_INT_ST    (BIT(0))
#define SPI_INLINK_DSCR_EMPTY_INT_ST_M  (BIT(0))
#define SPI_INLINK_DSCR_EMPTY_INT_ST_V  0x1
#define SPI_INLINK_DSCR_EMPTY_INT_ST_S  0

#define SPI_DMA_INT_CLR_OFFSET  (0x11C)
#define SPI_DMA_INT_CLR_REG(i)  (REG_SPI_BASE(i) + SPI_DMA_INT_CLR_OFFSET)

/* SPI_OUT_TOTAL_EOF_INT_CLR : R/W ;bitpos:[8] ;default: 1'b0 ; */

/* Description: The clear bit for sending all the packets to host done. */

#define SPI_OUT_TOTAL_EOF_INT_CLR    (BIT(8))
#define SPI_OUT_TOTAL_EOF_INT_CLR_M  (BIT(8))
#define SPI_OUT_TOTAL_EOF_INT_CLR_V  0x1
#define SPI_OUT_TOTAL_EOF_INT_CLR_S  8

/* SPI_OUT_EOF_INT_CLR : R/W ;bitpos:[7] ;default: 1'b0 ; */

/* Description: The clear bit for sending a packet to host done. */

#define SPI_OUT_EOF_INT_CLR     (BIT(7))
#define SPI_OUT_EOF_INT_CLR_M   (BIT(7))
#define SPI_OUT_EOF_INT_CLR_V   0x1
#define SPI_OUT_EOF_INT_CLR_S   7

/* SPI_OUT_DONE_INT_CLR : R/W ;bitpos:[6] ;default: 1'b0 ; */

/* Description: The clear bit for completing usage of a outlink descriptor. */

#define SPI_OUT_DONE_INT_CLR    (BIT(6))
#define SPI_OUT_DONE_INT_CLR_M  (BIT(6))
#define SPI_OUT_DONE_INT_CLR_V  0x1
#define SPI_OUT_DONE_INT_CLR_S  6

/* SPI_IN_SUC_EOF_INT_CLR : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: The clear bit for completing receiving all the packets from
 * host.
 */

#define SPI_IN_SUC_EOF_INT_CLR    (BIT(5))
#define SPI_IN_SUC_EOF_INT_CLR_M  (BIT(5))
#define SPI_IN_SUC_EOF_INT_CLR_V  0x1
#define SPI_IN_SUC_EOF_INT_CLR_S  5

/* SPI_IN_ERR_EOF_INT_CLR : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The clear bit for receiving error. */

#define SPI_IN_ERR_EOF_INT_CLR    (BIT(4))
#define SPI_IN_ERR_EOF_INT_CLR_M  (BIT(4))
#define SPI_IN_ERR_EOF_INT_CLR_V  0x1
#define SPI_IN_ERR_EOF_INT_CLR_S  4

/* SPI_IN_DONE_INT_CLR : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The clear bit for completing usage of a inlink descriptor. */

#define SPI_IN_DONE_INT_CLR    (BIT(3))
#define SPI_IN_DONE_INT_CLR_M  (BIT(3))
#define SPI_IN_DONE_INT_CLR_V  0x1
#define SPI_IN_DONE_INT_CLR_S  3

/* SPI_INLINK_DSCR_ERROR_INT_CLR : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The clear bit for inlink descriptor error. */

#define SPI_INLINK_DSCR_ERROR_INT_CLR    (BIT(2))
#define SPI_INLINK_DSCR_ERROR_INT_CLR_M  (BIT(2))
#define SPI_INLINK_DSCR_ERROR_INT_CLR_V  0x1
#define SPI_INLINK_DSCR_ERROR_INT_CLR_S  2

/* SPI_OUTLINK_DSCR_ERROR_INT_CLR : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The clear bit for outlink descriptor error. */

#define SPI_OUTLINK_DSCR_ERROR_INT_CLR    (BIT(1))
#define SPI_OUTLINK_DSCR_ERROR_INT_CLR_M  (BIT(1))
#define SPI_OUTLINK_DSCR_ERROR_INT_CLR_V  0x1
#define SPI_OUTLINK_DSCR_ERROR_INT_CLR_S  1

