apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_spi.h
/* SPI_INLINK_DSCR_EMPTY_INT_CLR : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: The clear bit for lack of enough inlink descriptors. */

#define SPI_INLINK_DSCR_EMPTY_INT_CLR    (BIT(0))
#define SPI_INLINK_DSCR_EMPTY_INT_CLR_M  (BIT(0))
#define SPI_INLINK_DSCR_EMPTY_INT_CLR_V  0x1
#define SPI_INLINK_DSCR_EMPTY_INT_CLR_S  0

#define SPI_IN_ERR_EOF_DES_ADDR_OFFSET   (0x120)
#define SPI_IN_ERR_EOF_DES_ADDR_REG(i)   (REG_SPI_BASE(i) + SPI_IN_ERR_EOF_DES_ADDR_OFFSET)

/* SPI_DMA_IN_ERR_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: The inlink descriptor address when spi dma produce receiving
 * error.
 */

#define SPI_DMA_IN_ERR_EOF_DES_ADDR    0xFFFFFFFF
#define SPI_DMA_IN_ERR_EOF_DES_ADDR_M  ((SPI_DMA_IN_ERR_EOF_DES_ADDR_V)<<(SPI_DMA_IN_ERR_EOF_DES_ADDR_S))
#define SPI_DMA_IN_ERR_EOF_DES_ADDR_V  0xFFFFFFFF
#define SPI_DMA_IN_ERR_EOF_DES_ADDR_S  0

#define SPI_IN_SUC_EOF_DES_ADDR_OFFSET  (0x124)
#define SPI_IN_SUC_EOF_DES_ADDR_REG(i)  (REG_SPI_BASE(i) + SPI_IN_SUC_EOF_DES_ADDR_OFFSET)

/* SPI_DMA_IN_SUC_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: The last inlink descriptor address when spi dma produce
 * from_suc_eof.
 */

#define SPI_DMA_IN_SUC_EOF_DES_ADDR    0xFFFFFFFF
#define SPI_DMA_IN_SUC_EOF_DES_ADDR_M  ((SPI_DMA_IN_SUC_EOF_DES_ADDR_V)<<(SPI_DMA_IN_SUC_EOF_DES_ADDR_S))
#define SPI_DMA_IN_SUC_EOF_DES_ADDR_V  0xFFFFFFFF
#define SPI_DMA_IN_SUC_EOF_DES_ADDR_S  0

#define SPI_INLINK_DSCR_OFFSET         (0x128)
#define SPI_INLINK_DSCR_REG(i)         (REG_SPI_BASE(i) + SPI_INLINK_DSCR_OFFSET)

/* SPI_DMA_INLINK_DSCR : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: The content of current in descriptor pointer. */

#define SPI_DMA_INLINK_DSCR     0xFFFFFFFF
#define SPI_DMA_INLINK_DSCR_M   ((SPI_DMA_INLINK_DSCR_V)<<(SPI_DMA_INLINK_DSCR_S))
#define SPI_DMA_INLINK_DSCR_V   0xFFFFFFFF
#define SPI_DMA_INLINK_DSCR_S   0

#define SPI_INLINK_DSCR_BF0_OFFSET     (0x12C)
#define SPI_INLINK_DSCR_BF0_REG(i)     (REG_SPI_BASE(i) + SPI_INLINK_DSCR_BF0_OFFSET)

/* SPI_DMA_INLINK_DSCR_BF0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: The content of next in descriptor pointer. */

#define SPI_DMA_INLINK_DSCR_BF0        0xFFFFFFFF
#define SPI_DMA_INLINK_DSCR_BF0_M      ((SPI_DMA_INLINK_DSCR_BF0_V)<<(SPI_DMA_INLINK_DSCR_BF0_S))
#define SPI_DMA_INLINK_DSCR_BF0_V      0xFFFFFFFF
#define SPI_DMA_INLINK_DSCR_BF0_S      0

#define SPI_INLINK_DSCR_BF1_OFFSET     (0x130)
#define SPI_INLINK_DSCR_BF1_REG(i)     (REG_SPI_BASE(i) + SPI_INLINK_DSCR_BF1_OFFSET)

/* SPI_DMA_INLINK_DSCR_BF1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: The content of current in descriptor data buffer pointer. */

#define SPI_DMA_INLINK_DSCR_BF1        0xFFFFFFFF
#define SPI_DMA_INLINK_DSCR_BF1_M      ((SPI_DMA_INLINK_DSCR_BF1_V)<<(SPI_DMA_INLINK_DSCR_BF1_S))
#define SPI_DMA_INLINK_DSCR_BF1_V      0xFFFFFFFF
#define SPI_DMA_INLINK_DSCR_BF1_S      0

#define SPI_OUT_EOF_BFR_DES_ADDR_OFFSET  (0x134)
#define SPI_OUT_EOF_BFR_DES_ADDR_REG(i)  (REG_SPI_BASE(i) + SPI_OUT_EOF_BFR_DES_ADDR_OFFSETs)

/* SPI_DMA_OUT_EOF_BFR_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: The address of buffer relative to the outlink descriptor
 * that produce eof.
 */

#define SPI_DMA_OUT_EOF_BFR_DES_ADDR    0xFFFFFFFF
#define SPI_DMA_OUT_EOF_BFR_DES_ADDR_M  ((SPI_DMA_OUT_EOF_BFR_DES_ADDR_V)<<(SPI_DMA_OUT_EOF_BFR_DES_ADDR_S))
#define SPI_DMA_OUT_EOF_BFR_DES_ADDR_V  0xFFFFFFFF
#define SPI_DMA_OUT_EOF_BFR_DES_ADDR_S  0

#define SPI_OUT_EOF_DES_ADDR_OFFSET     (0x138)
#define SPI_OUT_EOF_DES_ADDR_REG(i)     (REG_SPI_BASE(i) + SPI_OUT_EOF_DES_ADDR_OFFSET)

/* SPI_DMA_OUT_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: The last outlink descriptor address when spi dma produce
 * to_eof.
 */

#define SPI_DMA_OUT_EOF_DES_ADDR    0xFFFFFFFF
#define SPI_DMA_OUT_EOF_DES_ADDR_M  ((SPI_DMA_OUT_EOF_DES_ADDR_V)<<(SPI_DMA_OUT_EOF_DES_ADDR_S))
#define SPI_DMA_OUT_EOF_DES_ADDR_V  0xFFFFFFFF
#define SPI_DMA_OUT_EOF_DES_ADDR_S  0

#define SPI_OUTLINK_DSCR_OFFSET     (0x13C)
#define SPI_OUTLINK_DSCR_REG(i)     (REG_SPI_BASE(i) + SPI_OUTLINK_DSCR_OFFSET)

/* SPI_DMA_OUTLINK_DSCR : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: The content of current out descriptor pointer. */

#define SPI_DMA_OUTLINK_DSCR    0xFFFFFFFF
#define SPI_DMA_OUTLINK_DSCR_M  ((SPI_DMA_OUTLINK_DSCR_V)<<(SPI_DMA_OUTLINK_DSCR_S))
#define SPI_DMA_OUTLINK_DSCR_V  0xFFFFFFFF
#define SPI_DMA_OUTLINK_DSCR_S  0

#define SPI_OUTLINK_DSCR_BF0_OFFSET  (0x140)
#define SPI_OUTLINK_DSCR_BF0_REG(i)  (REG_SPI_BASE(i) + SPI_OUTLINK_DSCR_BF0_OFFSET)

/* SPI_DMA_OUTLINK_DSCR_BF0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: The content of next out descriptor pointer. */

#define SPI_DMA_OUTLINK_DSCR_BF0    0xFFFFFFFF
#define SPI_DMA_OUTLINK_DSCR_BF0_M  ((SPI_DMA_OUTLINK_DSCR_BF0_V)<<(SPI_DMA_OUTLINK_DSCR_BF0_S))
#define SPI_DMA_OUTLINK_DSCR_BF0_V  0xFFFFFFFF
#define SPI_DMA_OUTLINK_DSCR_BF0_S  0

#define SPI_OUTLINK_DSCR_BF1_OFFSET     (0x144)
#define SPI_OUTLINK_DSCR_BF1_REG(i)     (REG_SPI_BASE(i) + SPI_OUTLINK_DSCR_BF1_OFFSET)

/* SPI_DMA_OUTLINK_DSCR_BF1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: The content of current out descriptor data buffer pointer. */

#define SPI_DMA_OUTLINK_DSCR_BF1    0xFFFFFFFF
#define SPI_DMA_OUTLINK_DSCR_BF1_M  ((SPI_DMA_OUTLINK_DSCR_BF1_V)<<(SPI_DMA_OUTLINK_DSCR_BF1_S))
#define SPI_DMA_OUTLINK_DSCR_BF1_V  0xFFFFFFFF
#define SPI_DMA_OUTLINK_DSCR_BF1_S  0

#define SPI_DMA_RSTATUS_OFFSET  (0x148)
#define SPI_DMA_RSTATUS_REG(i)  (REG_SPI_BASE(i) + SPI_DMA_RSTATUS_OFFSET)

/* SPI_DMA_OUT_STATUS : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: spi dma read data from memory status. */

#define SPI_DMA_OUT_STATUS    0xFFFFFFFF
#define SPI_DMA_OUT_STATUS_M  ((SPI_DMA_OUT_STATUS_V)<<(SPI_DMA_OUT_STATUS_S))
#define SPI_DMA_OUT_STATUS_V  0xFFFFFFFF
#define SPI_DMA_OUT_STATUS_S  0

#define SPI_DMA_TSTATUS_OFFSET  (0x14C)
#define SPI_DMA_TSTATUS_REG(i)  (REG_SPI_BASE(i) + SPI_DMA_TSTATUS_OFFSET)

/* SPI_DMA_IN_STATUS : RO ;bitpos:[31:0] ;default: 32'b0 ; */

/* Description: spi dma write data to memory status. */

#define SPI_DMA_IN_STATUS    0xFFFFFFFF
#define SPI_DMA_IN_STATUS_M  ((SPI_DMA_IN_STATUS_V)<<(SPI_DMA_IN_STATUS_S))
#define SPI_DMA_IN_STATUS_V  0xFFFFFFFF
#define SPI_DMA_IN_STATUS_S  0

#define SPI_DATE_OFFSET         (0x3FC)
#define SPI_DATE_REG(i)         (REG_SPI_BASE(i) + SPI_DATE_OFFSET)

/* SPI_DATE : RO ;bitpos:[27:0] ;default: 32'h1604270 ; */

/* Description: SPI register version. */

#define SPI_DATE                0x0FFFFFFF
#define SPI_DATE_M              ((SPI_DATE_V)<<(SPI_DATE_S))
#define SPI_DATE_V              0xFFFFFFF
#define SPI_DATE_S              0

#endif /* __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_SPI_H */
